{
  "9-241": {
    "subqueries": [
      "What is kinetic energy?",
      "How can kinetic energy be identified or observed in everyday examples?",
      "Provide specific instances or scenarios where objects exhibit significant kinetic energy."
    ]
  },
  "1953": {
    "subqueries": [
      "What are examples of organisms with specialized cells or functions?",
      "What characteristics define an organism as being able to specialize?",
      "Which types of organisms lack the capability for specialization?"
    ]
  },
  "959": {
    "subqueries": [
      "What is the purpose or function of a compass arrow?",
      "How can one determine the opposite direction of a compass arrow?",
      "What does it mean for a person to be \"walking\" in terms of movement and orientation? "
    ]
  },
  "8-376": {
    "subqueries": [
      "What adaptations do frilled sharks have that allow them to thrive in deep ocean environments?",
      "What adaptations do anglerfish possess for living in deep-sea habitats?",
      "Why are species like frilled sharks and anglerfish often referred to by a specific term related to their habitat?  "
    ]
  },
  "8-422": {
    "subqueries": [
      "What is the behavior of a frog during the winter months?",
      "How does a frog protect itself from freezing temperatures?",
      "What happens to a frog when spring arrives?"
    ]
  },
  "7-97": {
    "subqueries": [
      "What types of products are commonly used to facilitate plant growth indoors during winter months?",
      "Which specific conditions do cabbages require for successful growth in January?",
      "Are there any particular products recommended specifically for growing cabbage under such conditions?"
    ]
  },
  "142": {
    "subqueries": [
      "What are some common units or terms used to describe the size of objects?",
      "How do measurements like length, width, height, and volume contribute to understanding an object's size?",
      "In what contexts might different methods be used to assess the size of an object (e.g., visual estimation vs. precise measurement)?"
    ]
  },
  "739": {
    "subqueries": [
      "What specific types of animals are known for hunting using a technique that involves cracking something open?",
      "What kind of prey or food source do these animals typically target with this method?",
      "How does the process of cracking open work, and what physical adaptations or tools do the animals use to accomplish this?"
    ]
  },
  "7-921": {
    "subqueries": [
      "What are some common processes or mechanisms by which a body can lose heat?",
      "Under what conditions might these processes lead to a noticeable decrease in the body's temperature?",
      "Are there specific scenarios, such as environmental changes or physical activities, that could trigger this cooling effect? "
    ]
  },
  "7-316": {
    "subqueries": [
      "What are the primary effects of the Earth's revolution around the Sun?",
      "How does the Earth's position relative to the Sun during its orbit impact seasons on Earth?",
      "In what ways do variations in solar radiation due to Earth's orbit influence climate patterns and weather events?  "
    ]
  },
  "9-1126": {
    "subqueries": [
      "What are the conditions necessary for dew formation?",
      "From where does water vapor in the air originate during dew formation?",
      "On what surfaces or objects does this water vapor typically condense to form dew?"
    ]
  },
  "9-1039": {
    "subqueries": [
      "What are some common methods used for collecting data?",
      "Can you provide examples of each method identified in the first question?",
      "How do these examples illustrate the concept of data collection? "
    ]
  },
  "8-22": {
    "subqueries": [
      "What defines \"long\" days in terms of daylight hours?",
      "Which months typically have the longest daylight hours in which hemisphere?",
      "How does weather (e.g., sunniness) vary by month and location?"
    ]
  },
  "7-684": {
    "subqueries": [
      "What characteristics define oil as a nonrenewable resource?",
      "What are the implications of using up oil reserves on future availability?",
      "How long does it typically take for oil to form naturally, and why is this significant in terms of renewability?"
    ]
  },
  "7-57": {
    "subqueries": [
      "Why can gas fill any container it is placed in?",
      "Can liquids fill containers completely like gases do? If not, why or why not?",
      "What are the differences between how gases and liquids behave when placed in a container?"
    ]
  },
  "9-902": {
    "subqueries": [
      "What are some common causes of wildfires that can occur in an open field?",
      "How might environmental conditions or human activities contribute to the spread of a fire from an open field to a forest?",
      "Are there any specific indicators or evidence that suggest how the fire started, despite people being far away from the woods? "
    ]
  },
  "9-900": {
    "subqueries": [
      "What is the general purpose of tunnels?",
      "What are some common types or categories of tunnels?",
      "What are typical construction methods and materials used in building tunnels?"
    ]
  },
  "8-9": {
    "subqueries": [
      "What is magma composed of in terms of minerals and elements?",
      "Does magma contain any gases, and if so, which ones are commonly found?",
      "How do the temperature and viscosity of magma affect its composition?  "
    ]
  },
  "7-1024": {
    "subqueries": [
      "What are the primary reasons or factors that cause birds to migrate?",
      "How does migrating south specifically benefit birds during the winter season?",
      "Are there any specific environmental conditions in southern regions that make them suitable for birds during winter? "
    ]
  },
  "529": {
    "subqueries": [
      "What is the average duration of a typical shower compared to a shorter shower?",
      "How does water usage change when reducing shower time from a typical length to a shorter one?",
      "What are the potential environmental or financial impacts of consistently taking shorter showers?"
    ]
  },
  "231": {
    "subqueries": [
      "What are the common ways roads pose a threat to wildlife?",
      "How do vehicle collisions specifically impact animal populations and individual health?",
      "In what ways can road infrastructure disrupt natural habitats and migration patterns for animals?"
    ]
  },
  "7-1139": {
    "subqueries": [
      "What are some key activities or practices that can contribute positively to environmental health?",
      "How do these activities or practices specifically benefit different aspects of the environment (such as air, water, soil, and biodiversity)?",
      "What measurable outcomes or indicators demonstrate a positive impact on the environment from implementing these activities or practices?"
    ]
  },
  "9-106": {
    "subqueries": [
      "What is the role of light in photosynthesis?",
      "How does light affect plant growth and development?",
      "Are there any other processes in plants that require light besides photosynthesis? "
    ]
  },
  "9-472": {
    "subqueries": [
      "What are the main components or substances required for the process of photosynthesis in plants?",
      "How does each component contribute to the overall photosynthesis process?",
      "Are there any specific conditions or factors that influence the availability or effectiveness of these components during photosynthesis?"
    ]
  },
  "7-606": {
    "subqueries": [
      "What is the astronomical definition of a winter solstice?",
      "On which dates does the winter solstice typically occur in the Northern and Southern Hemispheres?",
      "What natural phenomena are associated with the occurrence of the winter solstice? "
    ]
  },
  "7-131": {
    "subqueries": [
      "What are the typical conditions under which vapor condenses?",
      "During what time of day does vapor most commonly condense overnight?",
      "On which surfaces or objects does condensed vapor typically accumulate when it occurs overnight? "
    ]
  },
  "7-847": {
    "subqueries": [
      "What are the essential nutrients required by mushrooms for optimal growth?",
      "Which organic materials or substrates naturally contain these essential nutrients?",
      "How do different cultivation methods affect the nutrient availability in these sources for mushrooms?"
    ]
  },
  "230": {
    "subqueries": [
      "What is defined as a \"boiling point\"?",
      "How does the boiling process occur for substances in general?",
      "Which substances can be identified by their specific boiling points?"
    ]
  },
  "8-162": {
    "subqueries": [
      "What types of habitats are typically associated with peat?",
      "Which animals are known to inhabit peatlands or similar environments?",
      "Are there specific animals that rely on peatland ecosystems for their survival or behavior? "
    ]
  },
  "7-915": {
    "subqueries": [
      "What types of reproductive methods do frogs use?",
      "Are frog eggs hard or soft compared to other species' eggs?",
      "Why can't frogs give live birth?"
    ]
  },
  "8-38": {
    "subqueries": [
      "What are some examples of renewable resources available for environmental sustainability?",
      "How do these renewable resources contribute to being more environmentally friendly and sufficient?",
      "Which commonly perceived resource is actually considered nonrenewable among those typically categorized as renewable?"
    ]
  },
  "7-289": {
    "subqueries": [
      "What are the botanical criteria for classifying a fruit as a \"true berry\"?",
      "How does the structure of a strawberry differ from these criteria?",
      "Which part of the strawberry plant actually produces the small, seed-containing structures commonly referred to as \"strawberries\"?"
    ]
  },
  "670": {
    "subqueries": [
      "What variables are being tested or manipulated in the experiment?",
      "What is the expected outcome based on the hypothesis or theoretical framework guiding the experiment?",
      "What potential unforeseen factors or errors could influence the results of the experiment? "
    ]
  },
  "1565": {
    "subqueries": [
      "What are the main layers or parts of human skin?",
      "Which layer is identified as the outermost protective barrier of the skin?",
      "Is the epidermis included in this outermost layer? "
    ]
  },
  "7-512": {
    "subqueries": [
      "What organisms are involved in cocoon creation?",
      "Describe the process by which these organisms create cocoons.",
      "Under what conditions or stages of their lifecycle do these organisms typically create cocoons? "
    ]
  },
  "1282": {
    "subqueries": [
      "What natural phenomena contribute to the movement and change within Earth's systems?",
      "How do solar radiation and heat transfer influence Earth's physical processes?",
      "In what ways do internal geothermal activities provide energy that drives cycles such as plate tectonics or volcanic activity?  "
    ]
  },
  "1981": {
    "subqueries": [
      "What are the defining characteristics and biological classification of alligators?",
      "Where can alligator populations typically be found in the wild, and what are their natural habitats?",
      "How do alligators interact with their ecosystems and what role do they play in their environments? "
    ]
  },
  "1715": {
    "subqueries": [
      "What are the primary natural factors that can influence climate change?",
      "How have human activities contributed to changes in the rate of climate change?",
      "What evidence exists to show an acceleration in climate change rates over recent decades?"
    ]
  },
  "9-805": {
    "subqueries": [
      "What are the indicators or signs inside the cabin that suggest there is a storm occurring outside?",
      "How can sounds from outside provide evidence that it is storming?",
      "In what ways might changes in temperature or pressure inside the cabin indicate an external storm? "
    ]
  },
  "7-620": {
    "subqueries": [
      "What is the primary diet of a giraffe?",
      "How does the feeding behavior of giraffes differ from other herbivores?",
      "Are there specific types of plants or parts of plants that giraffes prefer to eat?"
    ]
  },
  "1061": {
    "subqueries": [
      "What specific resources or items are being referred to as \"a\" (e.g., water, shelter)?",
      "What characteristics of the desert make it difficult to find these resources?",
      "Are there any strategies or methods that can be employed to improve the chances of finding these resources in a desert environment?"
    ]
  },
  "721": {
    "subqueries": [
      "What are the essential hardware components required for running a Bitcoin operation?",
      "Which software and tools are crucial for managing a Bitcoin operation effectively?",
      "What security measures must be implemented to protect a Bitcoin operation?"
    ]
  },
  "1324": {
    "subqueries": [
      "What are the specific needs and characteristics of newborn whales that must be considered for their storage or care?",
      "What types of environments or facilities are typically used for storing or housing marine animals, particularly cetaceans like whales?",
      "How do current practices in whale conservation and rehabilitation ensure the safety and well-being of new whale offspring during storage or temporary care?"
    ]
  },
  "9-108": {
    "subqueries": [
      "What physiological adaptations do owls have that help them regulate their body temperature?",
      "How do owls' behaviors or habits during winter contribute to maintaining their body temperature?",
      "In what ways does an owl's diet support its ability to retain body heat in cold conditions? "
    ]
  },
  "353": {
    "subqueries": [
      "What environmental conditions typically cause animals to shiver?",
      "Which types of environments are known for having extreme temperatures or cold climates where animals might need to shiver to maintain body heat?",
      "Are there specific habitats, such as polar regions or high altitudes, where certain species are more likely to experience conditions that cause them to shiver?"
    ]
  },
  "7-191": {
    "subqueries": [
      "How many eggs can a land turtle typically lay in one nesting season?",
      "How does this compare to the number of eggs a sea turtle can lay during the same period?",
      "What are some factors that might influence the difference in egg-laying numbers between land turtles and sea turtles?"
    ]
  },
  "7-1028": {
    "subqueries": [
      "What types of squirrels are known for storing food?",
      "How do squirrels typically prepare or handle acorns for storage?",
      "Where do squirrels usually hide their stored acords?"
    ]
  },
  "9-989": {
    "subqueries": [
      "What are the primary environmental factors present outdoors during the day?",
      "How do these environmental factors interact with objects or materials placed outside?",
      "Which specific elements from these interactions can be received by an object left outside during the day?"
    ]
  },
  "9-753": {
    "subqueries": [
      "What environmental changes might have occurred in the area to cause the deer to move away?",
      "Are there any recent increases or introductions of predators in the area that could have influenced the deer's movement?",
      "Have there been significant human activities, such as construction or deforestation, recently conducted in the area?"
    ]
  },
  "9-634": {
    "subqueries": [
      "What is pasteurization?",
      "How does pasteurization affect bacterial populations?",
      "In which types of products or substances is pasteurization typically used?"
    ]
  },
  "1343": {
    "subqueries": [
      "What are some common environmental factors known to influence plant growth?",
      "How does soil quality impact plant development and health?",
      "In what ways do light and water availability affect the rate of plant growth?"
    ]
  },
  "7-114": {
    "subqueries": [
      "What are the primary differences between an electric car and a regular (gasoline-powered) car in terms of energy sources?",
      "How does an electric car's propulsion system operate without using gasoline?",
      "In what ways do electric cars improve energy efficiency compared to traditional gasoline cars?  "
    ]
  },
  "391": {
    "subqueries": [
      "What are the specific requirements (e.g., food, habitat, temperature) necessary for a particular organism's survival?",
      "How is an organism's survival rate defined or measured in ecological studies?",
      "What types of relationships can exist between an organism's requirements and its survival rate (e.g., direct, inverse, no correlation)?"
    ]
  },
  "7-384": {
    "subqueries": [
      "What are the key factors or conditions typically necessary for a revolution to occur?",
      "How do social, economic, and political grievances contribute to revolutionary movements?",
      "In what ways can leadership, organization, and external influences impact the success of a revolution? "
    ]
  },
  "7-1069": {
    "subqueries": [
      "What are the biological mechanisms by which zebras reproduce?",
      "How would sterility in a species like zebras affect their population dynamics and ecosystem roles?",
      "What potential ecological impacts could arise from the absence of zebras due to widespread sterility?"
    ]
  },
  "7-1148": {
    "subqueries": [
      "What are the typical ingredients found in pumpkin pie spice?",
      "Where do these individual ingredients (such as cinnamon, nutmeg, cloves, etc.) originate from geographically or historically?",
      "How is pumpkin pie spice typically produced and packaged for consumer use?"
    ]
  },
  "702": {
    "subqueries": [
      "What are some common seasonal changes that affect furry animals?",
      "How do these changes typically impact the behavior or physiology of these animals?",
      "Can you provide an analogy or example from human adaptations to explain one such change in a furry animal?"
    ]
  },
  "1303": {
    "subqueries": [
      "What is a fossil?",
      "Under what conditions do fossils typically form?",
      "What processes lead to the preservation of organisms as fossils?"
    ]
  },
  "9-1081": {
    "subqueries": [
      "What materials have high electrical conductivity?",
      "Which metals are commonly used as conductors in electrical applications?",
      "Are there any non-metallic substances that can also function as electrical conductors?"
    ]
  },
  "9-115": {
    "subqueries": [
      "What is ice wedging and how does it occur?",
      "Under what conditions does ice wedge formation lead to rock cracking?",
      "What changes happen within the cracks in rocks as a result of ice wedging that eventually causes them to split further?"
    ]
  },
  "8-195": {
    "subqueries": [
      "What defines a region as being known for experiencing all four seasons?",
      "What characterizes the winter season specifically?",
      "What are some typical activities that people might engage in during the winter season? "
    ]
  },
  "1177": {
    "subqueries": [
      "What are the key differences between a laser and the other tool or item being compared (e.g., flashlight, traditional light source)?",
      "What specific conditions or challenges might you encounter when navigating a basement?",
      "How do lasers perform in addressing these specific challenges or conditions found in basements?"
    ]
  },
  "1212": {
    "subqueries": [
      "What are some common types of resources essential for organism survival in an ecosystem?",
      "How does the availability or scarcity of these resources affect the health and population dynamics of organisms within an ecosystem?",
      "What specific indicators can be measured to demonstrate a negative impact on organisms due to loss of these essential resources? "
    ]
  },
  "701": {
    "subqueries": [
      "What is the primary composition of the surface of the planet on which we live?",
      "What types of vehicles are commonly used for transportation on solid surfaces?",
      "Which vehicle type would be most effective for traveling across the majority of this planet's surface?"
    ]
  },
  "536": {
    "subqueries": [
      "How does a bear's fur contribute to its survival?",
      "In what ways do duck's feathers aid in their survival?",
      "What are the common functions of fur and feathers that help animals survive?"
    ]
  },
  "539": {
    "subqueries": [
      "What factors influence the time of sunset?",
      "How does the latitude of a location affect sunset times throughout the year?",
      "What role do seasonal changes play in altering sunset times at various locations?"
    ]
  },
  "9-851": {
    "subqueries": [
      "What is meant by \"increases in the birth rate\" for a species population?",
      "How does an increase in the birth rate typically affect the overall population size of a species?",
      "What are some potential ecological or environmental impacts resulting from an increased population due to higher birth rates?"
    ]
  },
  "1408": {
    "subqueries": [
      "What is the principle or test used to determine the relative hardness of minerals?",
      "How does this principle define the relationship between two minerals where one can scratch the other?",
      "Can you provide an example pair of minerals where one can scratch the other, illustrating that the scratched mineral is softer? "
    ]
  },
  "9-280": {
    "subqueries": [
      "What are different types of sources of energy (e.g., renewable vs non-renewable)?",
      "How does each type of energy source generate power or fuel?",
      "What are the advantages and disadvantages of each type of energy source in terms of efficiency, cost, and environmental impact?"
    ]
  },
  "7-1196": {
    "subqueries": [
      "What are the essential components needed for producing a journal?",
      "What is the initial step or requirement in the process of journal production?",
      "Who are typically involved or responsible at the beginning stages of creating a journal? "
    ]
  },
  "8-457": {
    "subqueries": [
      "What is the typical behavior of water runoff when it rains on sloped or hilly terrain?",
      "How does water runoff from higher elevations affect lower adjacent areas in terms of water accumulation and flow?",
      "Are there any potential impacts, positive or negative, on ecosystems, agriculture, or infrastructure in the lower lands due to this runoff?"
    ]
  },
  "1277": {
    "subqueries": [
      "What constitutes a \"raw material\" in various industries or contexts?",
      "How can raw materials come directly from a natural source?",
      "Can you provide examples where the raw material remains largely unchanged from its original form when extracted? "
    ]
  },
  "933": {
    "subqueries": [
      "What are some common sources of sugar found in ecosystems?",
      "How do these sugar sources contribute to the energy flow within an ecosystem?",
      "In what ways do organisms depend on these sugar sources for survival and growth? "
    ]
  },
  "7-844": {
    "subqueries": [
      "What did Bill observe involving the wolf?",
      "How does this observation relate to the definition of a predator?",
      "Based on the observed behavior, why would Bill classify the wolf as a predator? "
    ]
  },
  "9-513": {
    "subqueries": [
      "What ingredients are commonly found in red pasta sauce?",
      "Which flowers are known for their use as culinary ingredients?",
      "Is there any common link between the ingredients of red pasta sauce and edible flowers?"
    ]
  },
  "607": {
    "subqueries": [
      "What are some typical markers or signs of adulthood across various animal and plant species?",
      "How do these markers differ between different kingdoms (such as animals vs. plants)?",
      "Are there any universal indicators of adulthood that can be observed consistently across multiple species? "
    ]
  },
  "7-605": {
    "subqueries": [
      "What is the definition of a melting point?",
      "How does heating affect substances in relation to their melting points?",
      "Can you provide examples of materials and their respective melting points?"
    ]
  },
  "7-1191": {
    "subqueries": [
      "What are the main layers of the Earth?",
      "Can you list any additional or less commonly known layers within each main layer of the Earth?",
      "Are there any geological features or components often mistaken as layers of the Earth that are not considered actual layers? "
    ]
  },
  "7-324": {
    "subqueries": [
      "What environmental conditions are essential for optimal plant growth?",
      "Which types of plants thrive under these optimal conditions?",
      "In what environments or situations might these necessary conditions be lacking?"
    ]
  },
  "9-1192": {
    "subqueries": [
      "What is the role of carbon dioxide in plant processes?",
      "What is the role of oxygen in animal respiratory processes?",
      "How do the roles of carbon dioxide in plants and oxygen in animals compare?"
    ]
  },
  "633": {
    "subqueries": [
      "What are some common methods of energy conservation for individuals?",
      "How can water usage be minimized in daily household activities?",
      "In what ways can an individual reduce waste and promote recycling effectively?"
    ]
  },
  "136": {
    "subqueries": [
      "What factors affect the speed of movement through water?",
      "How does density impact the speed at which different objects move through water?",
      "Which materials or objects have a higher density relative to water, potentially making them slower in movement?"
    ]
  },
  "7-946": {
    "subqueries": [
      "What are some common quirks or unique characteristics typically associated with bats?",
      "Are there any known bat species that do not exhibit these common quirks?",
      "Can you provide examples of features or behaviors in bats that might be considered exceptions to their usual quirks?"
    ]
  },
  "68": {
    "subqueries": [
      "What are the immediate environmental effects of oil leaking into ocean waters?",
      "How does the leaked oil impact marine life and ecosystems directly?",
      "What are the short-term consequences for coastal communities due to an offshore oil leak?"
    ]
  },
  "7-139": {
    "subqueries": [
      "What are the key characteristics and benefits of organic food?",
      "How does consuming organic food impact human health compared to non-organic options?",
      "Why do consumers and experts currently consider organic food as the best choice for people? "
    ]
  },
  "1253": {
    "subqueries": [
      "What is the relationship between distance from a water source and humidity levels in the air?",
      "How does the presence of water affect the concentration of water vapor in the surrounding atmosphere?",
      "What happens to the amount of water vapor as you move further away from its source? "
    ]
  },
  "8-101": {
    "subqueries": [
      "What components are present in the horse's meal consisting of hay, an apple, and a sugar cube?",
      "How does each component (hay, apple, sugar cube) get digested by the horse during its peaceful roaming in the field?",
      "Are there any physiological or behavioral changes in the horse while it is digesting these components after eating?"
    ]
  },
  "9-193": {
    "subqueries": [
      "What specific health metrics or indicators are being considered for determining who is healthier?",
      "What information or data do we have about each individual's lifestyle, diet, exercise habits, medical history, and environmental factors?",
      "How do these factors compare between the individuals in question, and how do they align with established health guidelines or standards?"
    ]
  },
  "9-961": {
    "subqueries": [
      "What are some examples of living things?",
      "What characteristics do living things share?",
      "How does each characteristic apply universally across different types of living organisms?"
    ]
  },
  "875": {
    "subqueries": [
      "What role do animals play in the pollination process of plants?",
      "How does the presence of certain immobile animals assist with seed dispersal?",
      "In what ways can decomposing matter from animals contribute to plant fertilization?"
    ]
  },
  "1252": {
    "subqueries": [
      "What are the different types of camouflage strategies used by animals or objects?",
      "Can you provide examples of specific species known for their effective use of camouflage in nature?",
      "How do humans utilize camouflage techniques in various fields such as military, fashion, or technology?"
    ]
  },
  "9-290": {
    "subqueries": [
      "What is the definition of \"stopped\" in general terms?",
      "In which contexts or scenarios is something typically described as \"stopped\"?",
      "What conditions or factors are usually associated with a state being described as \"stopped\"?"
    ]
  },
  "8-322": {
    "subqueries": [
      "What types of nutrients do plants provide as a primary food source for humans and animals?",
      "How do plants contribute to oxygen production in the atmosphere?",
      "In what ways do plants serve as raw materials or ingredients in various industries, such as pharmaceuticals or textiles? "
    ]
  },
  "9-305": {
    "subqueries": [
      "What is the primary function of the circulatory system in relation to oxygen?",
      "Through which pathway does oxygen enter the circulatory system?",
      "Where do we typically obtain oxygen that enters the circulatory system?"
    ]
  },
  "829": {
    "subqueries": [
      "What is known about the historical context or time period associated with Puppigerus?",
      "Are there any documented locations or regions where Puppigerus was active or mentioned in historical records?",
      "What sources provide information about Puppigerus, and what do they suggest about his place of residence?"
    ]
  },
  "7-1036": {
    "subqueries": [
      "What are examples of renewable resources?",
      "How can a specific renewable resource be utilized in production processes?",
      "What types of products or energy can be produced using this renewable resource? "
    ]
  },
  "854": {
    "subqueries": [
      "What types of relationships are commonly studied in genetics and biology?",
      "How is inheritance defined within these genetic or biological contexts?",
      "Which specific type of relationship involves the process or concept of inheritance as defined? "
    ]
  },
  "7-291": {
    "subqueries": [
      "What is the primary substance or resource used by a car engine in the process of combustion?",
      "How does a car engine use combustion to generate motion?",
      "In what way does a car engine produce heat through the process of combustion?"
    ]
  },
  "368": {
    "subqueries": [
      "What are some common sources of heat typically found at resorts?",
      "How do these sources of heat contribute to a guest's experience or comfort?",
      "Are there any specific features or attractions at this particular resort that rely on these sources of heat? "
    ]
  },
  "1158": {
    "subqueries": [
      "What types of products are designed to convert electrical energy into light energy?",
      "How does each identified product perform this conversion process?",
      "Are there any known limitations or scenarios where these products fail to convert electrical energy into light energy when turned on?"
    ]
  },
  "8-331": {
    "subqueries": [
      "What specific conditions are necessary for a magnetic effect to occur between two objects?",
      "How do the properties of the rocks (such as composition or size) influence their ability to be affected by magnetism?",
      "What type and strength of magnetic field would be required to pull two rocks together?"
    ]
  },
  "9-435": {
    "subqueries": [
      "What is refraction?",
      "In what mediums or situations is refraction most commonly observed?",
      "Can you provide specific examples where refraction is easily witnessed?"
    ]
  },
  "8-481": {
    "subqueries": [
      "What are the typical hunting methods used by a pelican?",
      "Where does the pelican usually go to find its food?",
      "How does a pelican determine when it is likely to catch fish? "
    ]
  },
  "8-86": {
    "subqueries": [
      "What are the key characteristics or features of the vat that should be described (e.g., size, shape, material)?",
      "What is the type and quality of the juice contained in the vat?",
      "How can the man effectively communicate this information to his friend, considering clarity and detail?"
    ]
  },
  "7-524": {
    "subqueries": [
      "What geological processes can lead to the formation of islands?",
      "How do volcanic activities contribute to the sudden appearance of islands?",
      "Are there any other natural phenomena, besides volcanic activity, that can cause rapid island formation?"
    ]
  },
  "7-951": {
    "subqueries": [
      "What are common illnesses that can typically be prevented through proactive measures?",
      "What specific preventive actions or lifestyle changes can help reduce the risk of these illnesses?",
      "How do public health initiatives and vaccinations contribute to the prevention of widespread diseases?"
    ]
  },
  "7-698": {
    "subqueries": [
      "What are the primary requirements for plant growth and survival?",
      "How do plants obtain nutrients necessary for their development?",
      "In what ways does sunlight influence the process of photosynthesis in plants?"
    ]
  },
  "452": {
    "subqueries": [
      "What is the physical state of water before it freezes?",
      "At what temperature does water typically begin to freeze under standard atmospheric pressure?",
      "What changes occur in the molecular structure of water when it transitions from liquid to solid?"
    ]
  },
  "692": {
    "subqueries": [
      "What is the name of the substance commonly used to create shiny metallic foil paper for cooking?",
      "Where are the raw materials for this substance typically sourced from or mined?",
      "Which industries or facilities process these raw materials into the final product used for creating the shiny metallic foil paper?"
    ]
  },
  "1305": {
    "subqueries": [
      "What are the natural dietary sources of Vitamin D?",
      "How does sun exposure contribute to Vitamin D synthesis in the body?",
      "Are there any fortified foods or supplements that provide Vitamin D?"
    ]
  },
  "1525": {
    "subqueries": [
      "What characteristics of flowers are known to influence their attractiveness to pollinators?",
      "How do environmental factors impact the presence and behavior of pollinators around flowers?",
      "In what ways can human interventions, such as gardening practices or habitat restoration, enhance a flower's ability to attract pollinators?"
    ]
  },
  "7-380": {
    "subqueries": [
      "What is the structure of chloroplasts within plant cells?",
      "In which types of plant cells are chloroplasts typically found?",
      "How does light influence the distribution or visibility of chloroplasts within those cells?  "
    ]
  },
  "8-396": {
    "subqueries": [
      "What are alternative liquids or beverages that can provide hydration?",
      "Which natural ingredients have moisturizing properties for the skin and body?",
      "Are there any topical products or treatments, aside from lotions containing water, that help maintain moisture levels in the skin?"
    ]
  },
  "375": {
    "subqueries": [
      "What are the primary mechanisms by which sunlight transfers heat energy?",
      "Which materials or surfaces absorb sunlight effectively and convert it into heat?",
      "How does the process of heat transfer from sunlight impact different environments, such as Earth's atmosphere and surface? "
    ]
  },
  "7-2": {
    "subqueries": [
      "What is the primary liquid medium humans typically swim in?",
      "What are the states or forms that a substance can take, including liquids?",
      "How do humans interact with and utilize different states of matter for activities such as swimming? "
    ]
  },
  "9-499": {
    "subqueries": [
      "What is pedal power and how does it work?",
      "Can you list some common items or machines that operate using pedal power?",
      "Which of the provided items on the list are typically moved or powered by human pedaling?  "
    ]
  },
  "9-1048": {
    "subqueries": [
      "What is the definition of a \"revolution\" in an astronomical context?",
      "How many days does it take for the Moon to complete one full orbit or revolution around Earth?",
      "Are there any variations or factors that could affect the duration of the Moon's revolution around Earth?"
    ]
  },
  "9-526": {
    "subqueries": [
      "What defines a \"human planet\"?",
      "Which celestial body is referred to as the \"human planet\"?",
      "What objects or bodies does this \"human planet\" orbit?"
    ]
  },
  "698": {
    "subqueries": [
      "What are some characteristics or behaviors associated with creatures that make noise by scraping limbs together?",
      "What types of environments support the existence and survival needs of such creatures?",
      "Can you identify specific small creatures known for this behavior and their typical habitats?"
    ]
  },
  "7-504": {
    "subqueries": [
      "What are the different types of bird beak shapes?",
      "Which factors influence the evolution and shape of a bird's beak?",
      "Can you provide examples of birds known for having angular or uniquely shaped beaks? "
    ]
  },
  "7-1054": {
    "subqueries": [
      "What are the conditions under which vapor typically begins to condense?",
      "How do temperature and pressure affect the state of a vapor?",
      "Why might a vapor have reduced energy or lower kinetic activity, leading to condensation?"
    ]
  },
  "50": {
    "subqueries": [
      "What specific type of change on Earth are we discussing (e.g., climate change, geological changes, biodiversity shifts)?",
      "What are the causes or factors contributing to this particular change?",
      "What are the observable effects and potential future impacts of this change on ecosystems, human societies, or global processes?"
    ]
  },
  "9-888": {
    "subqueries": [
      "What types of interactions do herbivores have with the plants they consume?",
      "Under what conditions or mechanisms can herbivores promote the growth and reproduction of the plant species they feed on?",
      "Can you provide examples of herbivore behaviors or effects that result in positive contributions to the same type of plants they eat?"
    ]
  },
  "150": {
    "subqueries": [
      "What type of component is used inside a typical incandescent light bulb to produce light?",
      "How does this component convert electrical energy into another form of energy?",
      "Specifically, what process within the component results in the production of light?"
    ]
  },
  "9-1111": {
    "subqueries": [
      "What natural processes or factors can cause a river to gradually lose water and potentially disappear?",
      "How do changes in climate and weather patterns affect the flow and sustainability of a river over time?",
      "In what ways can human activities contribute to the drying up or disappearance of a river? "
    ]
  },
  "9-101": {
    "subqueries": [
      "What type of power source does the fan require (e.g., electricity, batteries) and is it readily available in the room?",
      "Is the fan currently plugged into a functioning outlet or properly charged if battery-operated?",
      "Are there any safety checks needed before operating the fan, such as ensuring no obstructions nearby and that the fan is clean and free of debris?"
    ]
  },
  "1456": {
    "subqueries": [
      "What are the primary components of natural gas?",
      "How is natural gas formed and extracted?",
      "What are the common uses and benefits of natural gas?"
    ]
  },
  "8-235": {
    "subqueries": [
      "What does a \"temperature in the negatives\" mean?",
      "How is \"slightly less negative\" temperature quantified or measured from the initial temperature?",
      "What implications or changes occur when the temperature becomes \"more\" after getting slightly less negative? "
    ]
  },
  "7-494": {
    "subqueries": [
      "What are the different forms in which corn is consumed (e.g., raw, cooked, processed)?",
      "Who consumes corn as part of their diet? (Consider humans, animals, and other organisms.)",
      "In what culinary or industrial products is corn used as an ingredient? "
    ]
  },
  "1723": {
    "subqueries": [
      "What is the definition of decomposition?",
      "What are the main processes involved in decomposition?",
      "How does decomposition affect the ecosystem? "
    ]
  },
  "1275": {
    "subqueries": [
      "What are the components and characteristics of sunlight?",
      "How does sunlight affect Earth's climate and weather patterns?",
      "In what ways do living organisms rely on or are affected by sunlight?  "
    ]
  },
  "239": {
    "subqueries": [
      "What specific city did the deer enter?",
      "How many deer entered the city, and what is their current location within it?",
      "Why did the deer enter the city, and have there been any similar occurrences in the past?"
    ]
  },
  "9-1105": {
    "subqueries": [
      "What is meant by \"hourly totals of sunshine\"?",
      "How can a direct connection between two variables be defined or identified?",
      "What factors or phenomena might be directly connected to the hourly totals of sunshine?"
    ]
  },
  "1083": {
    "subqueries": [
      "What chemical reaction occurs when carbonic acid interacts with minerals in rocks?",
      "How does groundwater become enriched with carbonic acid, leading to its role in cave formation?",
      "What geological processes are involved in the transformation of dissolved materials into a cavern structure over time? "
    ]
  },
  "9-277": {
    "subqueries": [
      "What are remora fish commonly known for and how do they interact with other marine animals?",
      "What is the biological classification of remora fish, including their family name?",
      "How do remora fish benefit from their symbiotic relationships in the ocean ecosystem?"
    ]
  },
  "9-59": {
    "subqueries": [
      "What are the different types of interactions between plants and their physical environment?",
      "How does a plant root break or penetrate through hard surfaces such as rocks?",
      "Which biological process describes the phenomenon where plant roots grow into rock cracks to access water or nutrients?"
    ]
  },
  "9-299": {
    "subqueries": [
      "What celestial body does the Earth orbit around?",
      "How does the tilt of the Earth's axis affect its exposure to sunlight during its orbit?",
      "How do changes in solar radiation due to this tilt lead to different seasons on Earth?"
    ]
  },
  "7-254": {
    "subqueries": [
      "What are the characteristics of a white environment?",
      "In what types of settings or locations is a white environment commonly found?",
      "Are there specific activities, industries, or conditions associated with environments that are predominantly white?"
    ]
  },
  "7-596": {
    "subqueries": [
      "What materials or substances have magnetic properties that can align with Earth's magnetic field?",
      "Which of these materials are classified as metals?",
      "How do these metallic materials function as permanent magnets, specifically in terms of consistently pointing towards the geographic North? "
    ]
  },
  "1398": {
    "subqueries": [
      "What are some common methods or technologies used for producing alternative fuels?",
      "What materials or resources are typically required as inputs in these processes?",
      "What specific chemical or physical transformations occur during one of these production steps? "
    ]
  },
  "7-207": {
    "subqueries": [
      "What are the properties of a fingernail when pressed against different substances?",
      "How does salt react or change when pressure is applied to its surface?",
      "Are there any observable visual, tactile, or structural changes that occur when a fingernail presses against salt? "
    ]
  },
  "7-810": {
    "subqueries": [
      "What are some characteristics of environments that typically receive large amounts of rain?",
      "Which environmental factors contribute to these regions receiving high rainfall?",
      "Can you identify any exceptions where despite similar conditions, the environment receives significantly less rain? "
    ]
  },
  "8-230": {
    "subqueries": [
      "What are the primary instincts or behaviors of a mouse when it encounters potential predators?",
      "How do cats typically behave towards small rodents like mice?",
      "What factors contribute to a mouse's decision to flee when encountering a cat? "
    ]
  },
  "1368": {
    "subqueries": [
      "What natural process is primarily responsible for the formation of the Grand Canyon?",
      "How did the Colorado River contribute specifically to this geological feature's development over time?",
      "What other factors, besides water erosion, played a role in shaping the Grand Canyon?"
    ]
  },
  "7-15": {
    "subqueries": [
      "What are the primary hunting methods used by a golden eagle?",
      "How does a golden eagle use its talons during hunting?",
      "What types of prey do golden eagles typically catch with their talons? "
    ]
  },
  "8-47": {
    "subqueries": [
      "What factors or criteria might influence someone's decision to reject a food item?",
      "What characteristics typically define a \"really nice\" burger in terms of taste, presentation, and quality?",
      "Are there any specific reasons (e.g., dietary restrictions, personal preferences) that could lead someone to reject a high-quality burger despite its appeal?"
    ]
  },
  "1201": {
    "subqueries": [
      "What is meant by \"rotation\" in the context of planetary motion?",
      "How does Earth's rotation manifest itself in terms of daily and annual cycles?",
      "What are the effects or consequences of Earth's rotation on its environment and human activities?"
    ]
  },
  "1372": {
    "subqueries": [
      "What is the sequence of moon phases following a new moon?",
      "During which moon phase does a solar eclipse occur?",
      "After identifying the moon phase during a solar eclipse, what is the subsequent moon phase in the sequence?"
    ]
  },
  "7-623": {
    "subqueries": [
      "What are common sources of hydration available to a person who is thirsty?",
      "How does the human body absorb and utilize fluids for hydration?",
      "Are there any alternative methods or substances that can effectively hydrate a person besides drinking water? "
    ]
  },
  "164": {
    "subqueries": [
      "What are the household items listed?",
      "Which materials make up each of these household items?",
      "Are any of these materials accepted by local recycling programs or facilities?"
    ]
  },
  "1691": {
    "subqueries": [
      "What types of materials are magnets typically attracted to?",
      "How does magnetism work in attracting certain materials?",
      "Are there any exceptions or limitations to the materials that magnets can attract?"
    ]
  },
  "7-1166": {
    "subqueries": [
      "What are examples of animals that do not have teeth?",
      "How do these toothless animals obtain their food?",
      "What types of diets or feeding mechanisms allow them to consume food without the use of teeth? "
    ]
  },
  "9-1159": {
    "subqueries": [
      "What are some common types of flora found in forests?",
      "What types of fauna are typically present in forest ecosystems?",
      "Are there any natural resources or elements, other than plants and animals, that can be found in forests?"
    ]
  },
  "79": {
    "subqueries": [
      "How does consumer awareness impact the sales of a product?",
      "What are the typical financial outcomes for a seller when their product is not well-known or remembered by consumers?",
      "Are there strategies that can revive interest in a forgotten product and how might these affect revenue? "
    ]
  },
  "7-33": {
    "subqueries": [
      "What natural processes contribute to the formation of valleys?",
      "How do tectonic activities influence valley creation?",
      "In what ways do rivers and glaciers play a role in shaping valleys?"
    ]
  },
  "9-643": {
    "subqueries": [
      "What criteria are used to determine if a structure is considered an \"organ\" in the human body?",
      "Which part of the human body has the greatest surface area when compared with other organs?",
      "How does the skin compare in size and function to other potential large structures or systems within the body?"
    ]
  },
  "9-426": {
    "subqueries": [
      "What are examples of organisms that consume other living beings for energy and nutrients?",
      "How do different types of consumers (such as herbivores, carnivores, omnivores) obtain their food?",
      "Are there specific ecological roles or classifications for these organisms based on their diet?"
    ]
  },
  "220": {
    "subqueries": [
      "What type of energy does the element that heats toast use?",
      "In what appliance is this heating element typically found?",
      "What is the general term for components like this that convert electrical energy into heat?  "
    ]
  },
  "85": {
    "subqueries": [
      "What is weathering and what are its main types?",
      "How does each type of weathering affect different materials?",
      "Which specific materials or substances become smoother as a result of weathering processes?"
    ]
  },
  "9-545": {
    "subqueries": [
      "Who typically performs nest sitting for birds?",
      "What are the responsibilities involved in nest sitting?",
      "How do various species determine who takes on the role of nest sitting?"
    ]
  },
  "522": {
    "subqueries": [
      "What are the physical processes by which ice can change state or move from a higher position to a lower one?",
      "In what environments or situations might ice typically fall or descend, and what factors contribute to this?",
      "How do weather conditions, gravity, and other external forces affect the likelihood of ice falling down?"
    ]
  },
  "9-1098": {
    "subqueries": [
      "What are rocks typically composed of?",
      "What types of minerals or elements can be found within rocks?",
      "Are there any organic materials or fossils commonly found in certain rocks?"
    ]
  },
  "8-64": {
    "subqueries": [
      "What is a cocoon and which organisms typically create one?",
      "At what stage in an insect’s life cycle does it form a cocoon?",
      "Can you describe the process leading to the creation of a cocoon in insects? "
    ]
  },
  "1764": {
    "subqueries": [
      "What is the process of evaporation and how does it affect water at a molecular level?",
      "What changes occur in the physical state or properties of water during and after evaporation?",
      "What are the common outcomes or forms that result from the evaporation of water?  "
    ]
  },
  "1105": {
    "subqueries": [
      "How does a cat's fur change with seasonal temperature variations?",
      "What physiological responses do cats exhibit during warmer months?",
      "Are there any specific grooming behaviors or shedding patterns that occur in cats during the summer? "
    ]
  },
  "128": {
    "subqueries": [
      "What materials are commonly known to be attracted by magnets?",
      "How does a material's composition affect its magnetic properties?",
      "Are there any exceptions among metallic or non-metallic materials that might not typically attract magnets?"
    ]
  },
  "7-867": {
    "subqueries": [
      "What properties determine how much light a colored surface reflects?",
      "Why does a black wall reflect little light compared to other colors?",
      "How does the color of a surface, such as a pink wall, affect its reflection and perception?"
    ]
  },
  "9-351": {
    "subqueries": [
      "What is the definition of hypothermia and what body temperature threshold does it involve?",
      "Under what environmental temperatures can hypothermia occur for humans?",
      "Are there specific weather conditions or situations that increase the risk of developing hypothermia?"
    ]
  },
  "9-1054": {
    "subqueries": [
      "What natural processes can lead to the rounding of rocks?",
      "How do these processes contribute specifically to the smoothing and shaping of rock surfaces over time?",
      "Are there any specific environmental conditions or locations where this rounding is more commonly observed? "
    ]
  },
  "1557": {
    "subqueries": [
      "What are the common weather conditions that can decrease visibility while driving?",
      "How do environmental factors like dust, smoke, or fog affect driving visibility?",
      "In what ways can vehicle-related issues such as dirty windshields or malfunctioning lights impact a driver's ability to see clearly? "
    ]
  },
  "9-1097": {
    "subqueries": [
      "What are some common predators of octopuses?",
      "How do octopuses defend themselves against these predators?",
      "Specifically, what substances or mechanisms do octopuses use to impair the vision of their predators?"
    ]
  },
  "9-684": {
    "subqueries": [
      "What are the celestial bodies or objects commonly known to have moons?",
      "How do planets and dwarf planets compare in terms of having moons?",
      "Are there any other types of astronomical entities besides planets and dwarf planets that can contain moons?"
    ]
  },
  "8-444": {
    "subqueries": [
      "What substance did the Dutch and other farmers historically use to power the blades on structures that move water?",
      "What type of structure is commonly used to move water from low-lying areas to higher grounds?",
      "What units or instruments are typically used to measure the substance identified in question 1?"
    ]
  },
  "8-456": {
    "subqueries": [
      "What is meant by \"h20\" in this context?",
      "What type of event or process involves something falling from a fluffy object and landing on top of another surface?",
      "How would you describe a situation where an item lands on the top of cloth suspended on a rod?"
    ]
  },
  "9-571": {
    "subqueries": [
      "What are examples of inherited characteristics?",
      "How are these characteristics passed from parents to a baby?",
      "At what stage can inherited characteristics typically be observed in a baby?"
    ]
  },
  "9-798": {
    "subqueries": [
      "What types of environments or conditions allow certain animals to survive with minimal or no access to oxygen?",
      "Which specific adaptations do these animals have that enable them to thrive in low-oxygen or anaerobic conditions?",
      "Can you provide examples of any animal species known to live without a constant supply of oxygen?"
    ]
  },
  "8-326": {
    "subqueries": [
      "What is the melting point of the solid in question?",
      "At what temperature does this solid transition from a solid state to another phase when heated?",
      "What phase or form does the substance take on once it is heated above its melting point?"
    ]
  },
  "9-800": {
    "subqueries": [
      "What environmental cues does a beaver use to recognize that winter is approaching?",
      "How does increased food intake benefit a beater in preparing for the long winter months?",
      "In what ways can a beaver utilize its stored resources during the meager winter months?"
    ]
  },
  "9-151": {
    "subqueries": [
      "What physical or chemical changes occur when a candle is lit?",
      "How do these changes affect the structure of the candle itself over time?",
      "What are the immediate and long-term effects on the candle's surroundings, such as light emission and heat production?"
    ]
  },
  "8-440": {
    "subqueries": [
      "What specific heat level causes the shoe to change its form?",
      "How does the shoe's material respond or react to this particular heat level?",
      "What term or concept is used in materials science or engineering to describe a substance changing form at a certain temperature? "
    ]
  },
  "9-329": {
    "subqueries": [
      "What is the primary function of nerves in relation to sensory perception?",
      "Which specific type of nerve endings are responsible for detecting sensations on the skin?",
      "What kinds of stimuli can these nerve endings sense on the skin?"
    ]
  },
  "1734": {
    "subqueries": [
      "What are vaccines and how do they work?",
      "What types of vaccines exist and what diseases do they prevent?",
      "What is the process for developing, testing, and approving a vaccine before it becomes available to the public? "
    ]
  },
  "1708": {
    "subqueries": [
      "What types of equipment or materials might Jim need to incubate chicken eggs effectively?",
      "What are the optimal conditions (temperature, humidity, turning frequency) required for hatching chicken eggs successfully?",
      "How long does it typically take for baby chickens (chicks) to hatch from gathered eggs under ideal conditions?"
    ]
  },
  "7-556": {
    "subqueries": [
      "What are some common methods used to combine substances?",
      "Can you provide examples where pouring is specifically used as a method to combine substances?",
      "In what scenarios or contexts might combining substances through pouring be advantageous or necessary?  "
    ]
  },
  "7-535": {
    "subqueries": [
      "What tools or technologies are commonly used for viewing stars more easily?",
      "How do these tools improve the visibility and observation of stars compared to the naked eye?",
      "Are there any environmental factors that enhance or hinder star viewing, and how can they be managed?"
    ]
  },
  "7-949": {
    "subqueries": [
      "What are some common dishes where sugar is used to enhance sweetness?",
      "How does sugar chemically or physically alter the flavor profile of these dishes?",
      "Are there any specific ingredients in these dishes that interact with sugar to amplify its sweetening effect?"
    ]
  },
  "483": {
    "subqueries": [
      "What constitutes a \"protected environment\"?",
      "What activities are typically prohibited or restricted within protected environments?",
      "How is getting in trouble defined or enforced in these settings? "
    ]
  },
  "8-158": {
    "subqueries": [
      "What specific types of weather advisories have been issued due to the winter storm?",
      "How has the winter storm impacted road conditions and visibility for drivers in the city?",
      "What unexpected events or obstacles might the man encounter while driving on the highway during such a severe winter storm?"
    ]
  },
  "1637": {
    "subqueries": [
      "What causes the difference in seasons between the northern and southern hemispheres?",
      "During which season does the northern hemisphere experience its longest day of the year?",
      "What season corresponds to this time period in the southern hemisphere?"
    ]
  },
  "855": {
    "subqueries": [
      "What are the primary components or substances needed for photosynthesis to occur?",
      "Which environmental factors influence the rate and efficiency of photosynthesis?",
      "What specific parts of a plant cell are involved in carrying out photosynthesis? "
    ]
  },
  "9-143": {
    "subqueries": [
      "What characteristics make air and water viable sources of energy?",
      "Why might air and water be considered renewable or sustainable energy sources?",
      "Can you provide examples of technologies that utilize air and water as energy sources?"
    ]
  },
  "9-250": {
    "subqueries": [
      "What types of natural events can affect bodies of water?",
      "How do human activities impact standing bodies of water?",
      "What are the specific characteristics or conditions of a \"standing\" body of water that make it susceptible to disturbances?"
    ]
  },
  "790": {
    "subqueries": [
      "What is meant by \"seasons\" in this context?",
      "How many categories or types of \"seasons\" are being referred to with \"twenty-four\"?",
      "What specific subject or entity do these \"twenty-four new seasons\" belong to?  "
    ]
  },
  "1348": {
    "subqueries": [
      "What materials are commonly considered recyclable?",
      "How can you determine if a specific item is recyclable in your local area?",
      "Are there any certifications or labels on products that indicate they are recyclable?"
    ]
  },
  "941": {
    "subqueries": [
      "What is the relationship between force, mass, and acceleration according to Newton's second law of motion?",
      "How does the application of a constant force affect objects with different masses in terms of their accelerations?",
      "Given two blocks with unequal masses and a common force applied to both, which block will experience greater acceleration?"
    ]
  },
  "7-957": {
    "subqueries": [
      "What are the primary habitats of sea turtles?",
      "Which marine animals and organisms typically inhabit these areas alongside sea turtles?",
      "Are there any specific interactions or relationships between sea turtles and these shared species? "
    ]
  },
  "9-838": {
    "subqueries": [
      "What are the factors that influence sunlight absorption on Earth?",
      "How do different surfaces (e.g., water, forests, urban areas) compare in terms of their ability to absorb sunlight?",
      "What role does atmospheric composition play in the absorption of sunlight?"
    ]
  },
  "8-12": {
    "subqueries": [
      "What specific adaptations allow some fish species to leave the water and hunt on land?",
      "In which environments or conditions do these fish typically lurk in shallow water for hunting purposes?",
      "Over what time period do these fish develop the ability to hunt out of water, and how does this process occur?  "
    ]
  },
  "8-198": {
    "subqueries": [
      "What types of devices or tools allow a person to breathe underwater?",
      "How do these devices or tools function to enable prolonged or permanent underwater living?",
      "Are there any existing technologies that support complete and sustainable life underwater for humans?"
    ]
  },
  "1578": {
    "subqueries": [
      "What are the primary effects of storms on different environments (e.g., coastal areas, urban settings)?",
      "How do storms impact human activities and infrastructure?",
      "In what ways can storms contribute to natural changes or events in ecosystems?"
    ]
  },
  "6": {
    "subqueries": [
      "What are the common materials used in the production of greeting cards?",
      "How are these materials sourced for manufacturing greeting cards?",
      "Who or what entity controls the supply and distribution of these raw materials?"
    ]
  },
  "9-1002": {
    "subqueries": [
      "What are examples of animals with complex behavioral patterns?",
      "How do learned behaviors differ from instinctual behaviors in animals?",
      "Which specific animals have been studied extensively for their capacity to learn new behaviors?"
    ]
  },
  "7-305": {
    "subqueries": [
      "What are the common hunting methods used by hawks?",
      "How do these methods contribute to a successful hunt?",
      "What factors influence a hawk's choice of hunting method? "
    ]
  },
  "9-1004": {
    "subqueries": [
      "What patterns or shapes do people commonly perceive among the stars in the night sky?",
      "How does the position of stars appear to change over the course of a year due to Earth's movement around the Sun?",
      "Are there any specific events, like constellations' visibility changes, that occur annually in relation to star positions?"
    ]
  },
  "9-4": {
    "subqueries": [
      "What is the primary function of the system of tubes in a plant stem?",
      "How do these tubes facilitate the transportation of water within the plant?",
      "In what way do these tubes transport nutrients, and where are they distributed?"
    ]
  },
  "1445": {
    "subqueries": [
      "What are different types of changes (e.g., geological, climatic, biological) that can occur on Earth?",
      "Can you provide specific examples for each type of change identified?",
      "How do these changes impact the Earth's systems or environment over time? "
    ]
  },
  "8-214": {
    "subqueries": [
      "What physical characteristics or adaptations do tunas possess that are related to swimming speed?",
      "How do these adaptations enable tunas to achieve high speeds in the water?",
      "In what ways do seahorses differ in terms of body structure and movement, affecting their swimming speed? "
    ]
  },
  "1653": {
    "subqueries": [
      "Who is credited with inventing the process of pasteurization?",
      "What are some other fields or industries where this inventor contributed work or research?",
      "Can you provide examples of specific projects, discoveries, or advancements made by this individual outside of pasteurization?"
    ]
  },
  "9-680": {
    "subqueries": [
      "What is the specific role of leaves in the process of photosynthesis?",
      "How do leaves contribute to the efficiency of photosynthesis?",
      "In what ways are leaves structured or adapted to support their role in photosynthesis? "
    ]
  },
  "7-278": {
    "subqueries": [
      "What geological processes lead to the formation of canyons?",
      "How do cliffs develop within these canyon structures?",
      "What specific characteristics define a canyon's overall rock composition? "
    ]
  },
  "8-104": {
    "subqueries": [
      "What components are necessary for creating an electrically lit room that operates with a single switch?",
      "How does electricity travel within a completed electrical circuit to power the lighting in the room?",
      "What role do conductors play in ensuring the light is activated when the switch is flicked?"
    ]
  },
  "9-211": {
    "subqueries": [
      "What are the primary inputs involved in the cellular process of converting oxygen and carbohydrates?",
      "What are the main outputs produced by this cellular process?",
      "What is the name of the cellular process that involves these specific inputs and outputs?  "
    ]
  },
  "9-640": {
    "subqueries": [
      "What is a wasp's primary mechanism for defense or attack?",
      "How does a wasp use its stinger when interacting with threats or prey?",
      "Under what circumstances might a wasp choose to use its stinger? "
    ]
  },
  "8-465": {
    "subqueries": [
      "What are the primary factors that influence the cycle of day and night on a planet?",
      "How does a planet's rotation contribute to the transition between day and night?",
      "Are there any additional phenomena or factors (such as axial tilt or orbital position) that can affect the duration and occurrence of day and night on a planet?"
    ]
  },
  "9-104": {
    "subqueries": [
      "What types of materials do birds typically use for nest building?",
      "Where are these nesting materials commonly found in nature?",
      "How do birds identify and gather these materials from their environment?"
    ]
  },
  "645": {
    "subqueries": [
      "How does exposure to extremely cold temperatures affect the human body?",
      "What are some psychological and physiological responses humans have when they become disoriented or lost, such as in a forest?",
      "How can extreme stress or fear contribute to sleepiness or exhaustion?"
    ]
  },
  "1847": {
    "subqueries": [
      "What characteristics define a forested environment?",
      "Why do forested environments typically appear green?",
      "Can you provide examples of specific types or locations of forested environments that are known for being green?"
    ]
  },
  "1566": {
    "subqueries": [
      "What are the primary ingredients used to make lemonade?",
      "How do these ingredients interact to create a specific taste profile?",
      "Are there any common descriptors or terms used to characterize the flavor of lemonade? "
    ]
  },
  "1629": {
    "subqueries": [
      "What are the most common dietary patterns or cuisines found among city-dwellers?",
      "How does access to various types of food outlets (like supermarkets, farmers' markets, fast-food restaurants) influence the eating habits of people living in urban areas?",
      "What role do factors such as income level, cultural diversity, and lifestyle choices play in determining the dietary preferences of individuals residing in cities?"
    ]
  },
  "7-419": {
    "subqueries": [
      "What characteristics or features typically attract pollinators to flowers?",
      "Which types of organisms are commonly considered pollinators in various ecosystems?",
      "How do specific plants adapt their structures, colors, scents, and nectar production to appeal to different pollinator species? "
    ]
  },
  "1220": {
    "subqueries": [
      "What are some typical characteristics of the summer season in terms of weather and environment?",
      "How does the transition from summer to fall typically affect temperatures and daylight hours?",
      "What changes occur in plant life and natural landscapes during the shift from summer to fall? "
    ]
  },
  "7-84": {
    "subqueries": [
      "What are the primary components or layers that make up Earth's structure?",
      "How does each layer contribute to the overall composition of Earth’s surface?",
      "What materials or elements are predominantly found in the outermost layer, also known as the crust? "
    ]
  },
  "7-200": {
    "subqueries": [
      "What is a \"stink sack\" and how does it function in skunks?",
      "How do skunks use their stink sacks as a defense mechanism?",
      "Are there any other animals with similar defense mechanisms involving scent glands?"
    ]
  },
  "1360": {
    "subqueries": [
      "What criteria are used to define a \"live birth\" in medical or statistical terms?",
      "Can you list examples of different types of births (e.g., natural, cesarean) and determine which category typically results in the highest rate of live births?",
      "Are there any notable historical or recent cases that highlight particularly successful instances of live births?"
    ]
  },
  "9-898": {
    "subqueries": [
      "What is a hydrocarbon chain containing eight carbon atoms commonly referred to as?",
      "List the possible uses or products that utilize hydrocarbon chains with eight carbon atoms.",
      "For each listed use or product, how many such hydrocarbon chains are typically required?"
    ]
  },
  "9-1140": {
    "subqueries": [
      "What is evaporation and how does it occur?",
      "In what processes or situations is evaporation a key factor?",
      "How does evaporation contribute to these specific processes or situations? "
    ]
  },
  "9-471": {
    "subqueries": [
      "What are the key factors influencing chicken population growth on farms?",
      "What methods or technologies can farmers use to increase chicken reproduction rates effectively?",
      "How do changes in farm management practices impact overall chicken health and sustainability of larger populations?"
    ]
  },
  "9-953": {
    "subqueries": [
      "What are the characteristics of items that produce minimal pollution during their production process?",
      "Can you list some examples of such low-pollution-producing items typically manufactured in a factory setting?",
      "What changes or technologies can be implemented in the manufacturing process to ensure the production of these items results in minimal pollution?"
    ]
  },
  "348": {
    "subqueries": [
      "What are some examples of different sources of power?",
      "Which of these sources are classified as renewable or non-renewable?",
      "How do non-renewable sources of power differ in terms of depletion compared to renewable sources?"
    ]
  },
  "458": {
    "subqueries": [
      "What are some common ways dogs try to cool down when it's hot?",
      "How does Lassie specifically respond or behave in hot weather based on her typical characteristics or past behaviors?",
      "Are there any environmental factors or available resources that might influence how Lassie chooses to beat the heat?"
    ]
  },
  "7-974": {
    "subqueries": [
      "What term is used for making guesses or assumptions in scientific inquiry?",
      "How does \"cause and effect\" relate to forming hypotheses or assumptions in the scientific method?",
      "Is there a specific name for a hypothesis that focuses on determining causes and their effects within science? "
    ]
  },
  "1116": {
    "subqueries": [
      "What are the physical processes involved in the cycles of freezing and thawing water?",
      "How do these cycles affect the surrounding environment and materials (e.g., soil, rocks)?",
      "What conditions or factors influence the frequency and intensity of these freeze-thaw cycles? "
    ]
  },
  "7-41": {
    "subqueries": [
      "What are examples of animals with two legs?",
      "What types of sounds do these two-legged animals typically make?",
      "Can you provide specific examples or categories of the sounds made by two-legged animals?"
    ]
  },
  "7-785": {
    "subqueries": [
      "What are the common technologies or methods used by devices for geographic location tracking?",
      "How can these technologies identify specific portions within larger areas like forests?",
      "What criteria define the \"northern portion\" of a forest, and how is it determined using location data? "
    ]
  },
  "7-473": {
    "subqueries": [
      "What is the biological process involved in scar formation?",
      "Are there genetic or environmental factors that influence how scars form on the skin?",
      "How do different types of wounds (e.g., cuts, burns) affect the natural development of scars?"
    ]
  },
  "9-555": {
    "subqueries": [
      "What types of food do opossums and raccoons typically scavenge for in urban environments?",
      "How does consuming human waste or trash impact the nutritional intake of these creatures?",
      "In what ways can an improper diet from scavenging affect the health of opossums and raccoons?"
    ]
  },
  "7-815": {
    "subqueries": [
      "What qualifies a substance as \"life-sustaining\"?",
      "Which essential life processes do these substances support or enable in living organisms?",
      "How are these life-sustaining substances typically obtained, stored, and utilized by organisms? "
    ]
  },
  "9-604": {
    "subqueries": [
      "What are the specific months typically considered \"the heart of summer\" in Australia?",
      "Which month immediately follows December in the Gregorian calendar?",
      "Are there any cultural or regional terms used to describe the period a few weeks after December in Australia?"
    ]
  },
  "1539": {
    "subqueries": [
      "What are the dietary habits of obligate carnivores?",
      "Which species exclusively consume animal flesh as their primary food source?",
      "Are there any exceptions where a typically carnivorous diet includes non-animal matter? "
    ]
  },
  "7-737": {
    "subqueries": [
      "What are the key vitamins involved in bone health and maintenance?",
      "How do these vitamins contribute to the healing process of bones?",
      "Are there any specific conditions or deficiencies related to these vitamins that can affect bone healing?"
    ]
  },
  "9-689": {
    "subqueries": [
      "What is the definition or meaning of \"conservation\"?",
      "Can you provide examples of actions or practices considered as conservation efforts?",
      "How do these examples demonstrate the principles of conservation? "
    ]
  },
  "7-831": {
    "subqueries": [
      "What are the characteristics of materials classified as electric insulators?",
      "How do electric insulators differ from conductors in terms of electron movement?",
      "Can you name some common examples or types of materials that are used as electric insulators?"
    ]
  },
  "9-822": {
    "subqueries": [
      "What are the components involved in hitting the keys of a piano?",
      "How does the action of pressing piano keys translate into sound production?",
      "In what ways can this process be compared to other activities or phenomena? "
    ]
  },
  "8-84": {
    "subqueries": [
      "What are some common methods or devices used for generating electricity?",
      "How does each method convert energy into electrical power?",
      "Which of these methods, if connected to a circuit with a light bulb, would cause it to illuminate?"
    ]
  },
  "7-264": {
    "subqueries": [
      "What are some common methods by which seeds are naturally dispersed in nature?",
      "How do animals contribute to seed dispersal mechanisms?",
      "Can you provide examples of unique or less common ways that human activities or natural events lead to seed dispersal?  "
    ]
  },
  "156": {
    "subqueries": [
      "What factors determine if a plate appears larger compared to others?",
      "How does visual perception affect our assessment of size differences among objects such as plates?",
      "Are there specific design elements or contexts that can make one plate seem larger than another?"
    ]
  },
  "7-631": {
    "subqueries": [
      "What specific types of ritual behaviors do animals exhibit during the springtime?",
      "Which animal species are known for engaging in these rituals during this season?",
      "How do environmental or biological factors trigger these ritual behaviors in the spring? "
    ]
  },
  "775": {
    "subqueries": [
      "What are the factors that affect the heat energy of a pond?",
      "How does temperature change over time in this specific pond?",
      "At what times or conditions was the temperature recorded as lower in this pond?"
    ]
  },
  "9-39": {
    "subqueries": [
      "What are some methods or technologies available for altering plant genetics or characteristics without direct physical interaction?",
      "How do these methods ensure changes in the plant's traits, and what biological mechanisms do they target?",
      "What are the ethical considerations and potential impacts on ecosystems when using such indirect alteration techniques?"
    ]
  },
  "8-303": {
    "subqueries": [
      "What is the process called where an image of an object is cast onto a screen using a pinhole?",
      "Why might people be encouraged to partake in this activity en masse recently?",
      "What benefits or reasons could there be for enjoying this particular activity? "
    ]
  },
  "9-119": {
    "subqueries": [
      "What characteristics define a \"thin\" beak?",
      "Which animals or birds typically have thin beaks?",
      "In what environments or for which specific feeding habits are thin beaks most advantageous?"
    ]
  },
  "7-882": {
    "subqueries": [
      "What are the main characteristics of bacteria?",
      "How do bacteria differ from other microorganisms such as viruses and fungi?",
      "In what environments can bacteria typically be found?"
    ]
  },
  "8-349": {
    "subqueries": [
      "What is sleet and how does it form?",
      "What are the primary components or materials that make up sleet?",
      "How do weather conditions affect the formation and composition of selt? "
    ]
  },
  "9-249": {
    "subqueries": [
      "What is the primary function of a telephone with respect to sound?",
      "How do telephones convert acoustic signals into a form suitable for transmission?",
      "What type of energy is used by telephones to transmit these converted signals over distances?"
    ]
  },
  "9-950": {
    "subqueries": [
      "What is the typical amount of water required for okra plants to grow effectively?",
      "How many hours of sunlight per day do okra plants generally need for optimal growth?",
      "Besides water and sunlight, what other essential nutrients or conditions are necessary for okra cultivation?"
    ]
  },
  "8-61": {
    "subqueries": [
      "What are the key environmental factors that influence agricultural productivity (e.g., soil quality, climate conditions, water availability)?",
      "How do different farming practices (e.g., crop farming, livestock rearing) determine specific environmental requirements?",
      "What geographic or ecological regions are known to provide optimal conditions for various types of agriculture? "
    ]
  },
  "8-441": {
    "subqueries": [
      "What are the components of the fan involved when it is turned on?",
      "How does turning on the fan initiate the rotation of its blades?",
      "In what manner do the blades of the fan move once activated? "
    ]
  },
  "9-1188": {
    "subqueries": [
      "What is the definition of \"windy\"?",
      "How is wind speed measured and classified?",
      "At what wind speed range are winds typically considered to be blowing at high speeds?"
    ]
  },
  "1513": {
    "subqueries": [
      "What is the typical diet of a scavenger?",
      "Which types of food sources do scavengers commonly consume?",
      "Are there specific animals or environments where certain scavengers are more prevalent?"
    ]
  },
  "9-862": {
    "subqueries": [
      "What characteristics define a flexible container?",
      "Can you provide examples of materials typically used in making flexible containers?",
      "Are there any specific types or industries where flexible containers are commonly utilized? "
    ]
  },
  "9-615": {
    "subqueries": [
      "What are the primary uses of a lake?",
      "How is a pond typically utilized by people and wildlife?",
      "In what ways can a stream be beneficial for its surrounding environment? "
    ]
  },
  "9-391": {
    "subqueries": [
      "What is the relationship between a flower's fragrance intensity and its likelihood of attracting pollinators?",
      "How does increased fragrance affect a flower's visibility or detectability in its environment?",
      "In what ways might an increase in fragrance improve a flower's reproductive success? "
    ]
  },
  "1143": {
    "subqueries": [
      "What is the nature of the sun's gravitational pull?",
      "How does gravity affect objects in space, particularly those near a massive body like the sun?",
      "What specific phenomena result from the sun’s gravitational influence on nearby objects or systems?"
    ]
  },
  "8-118": {
    "subqueries": [
      "What are the various types of defensive behaviors or strategies that prey animals might employ?",
      "How do physical adaptations contribute to a prey animal's ability to evade predators?",
      "In what ways can environmental factors aid a prey animal in escaping from potential attacks?"
    ]
  },
  "9-158": {
    "subqueries": [
      "What are some terms used for mimicry in nature where one organism resembles another?",
      "How do insects specifically engage in this form of mimicry, and what benefits might they gain from it?",
      "Are there any specific examples of insects that look like other types of entities as a result of this phenomenon?"
    ]
  },
  "1279": {
    "subqueries": [
      "What are the different types of weathering processes?",
      "How do these weathering processes typically occur over time?",
      "Can you provide a specific example where one or more of these processes have been observed to cause changes in geological features over several years?"
    ]
  },
  "7-22": {
    "subqueries": [
      "What does \"thermal production\" refer to in the context of stoves?",
      "How do stoves typically use thermal energy?",
      "In what applications or settings are stoves generally utilized? "
    ]
  },
  "1392": {
    "subqueries": [
      "What is the function of nerves in the human body?",
      "How do nerves contribute to the sensory system?",
      "What types of stimuli can nerves detect and transmit information about?"
    ]
  },
  "179": {
    "subqueries": [
      "What is the process of respiration?",
      "How does respiration contribute to energy production in cells?",
      "Are there any biological processes or activities that specifically require respiration for energy utilization?"
    ]
  },
  "1429": {
    "subqueries": [
      "What are the primary organs involved in human food digestion?",
      "What enzymes and substances aid in breaking down different types of nutrients during digestion?",
      "How do external factors, such as diet or lifestyle choices, influence the efficiency of human digestion?"
    ]
  },
  "1706": {
    "subqueries": [
      "What direction was indicated by the arrow on the compass?",
      "If you turn around from facing the direction of the compass arrow, which direction are you now facing?",
      "In which direction were we ultimately walking after turning around?"
    ]
  },
  "1068": {
    "subqueries": [
      "What is the primary element of the respiratory system where gas exchange occurs?",
      "What gases are primarily involved in the diffusion process during this exchange?",
      "Through what mechanism or structure does the diffusion of these gases occur? "
    ]
  },
  "624": {
    "subqueries": [
      "What are some common strategies and efforts used for preserving ecosystems within national parks?",
      "How do these preservation efforts potentially impact the management and operations of national parks?",
      "In what ways can changes in ecosystem preservation practices influence visitor experiences, biodiversity, or park regulations?  "
    ]
  },
  "7-201": {
    "subqueries": [
      "What are some common types of environmental changes or challenges humans face when moving into new environments?",
      "How do human bodies and behaviors typically adapt physiologically, psychologically, and socially to these new environmental conditions?",
      "What are the potential long-term impacts on both the environment and human communities resulting from such movements?"
    ]
  },
  "932": {
    "subqueries": [
      "What happens to ingredients like chocolate or butter when exposed to heat for prolonged periods?",
      "How does overcooking affect the texture of no-bake cookies specifically?",
      "Why might no-bake cookies become hard without being burnt if cooked too long? "
    ]
  },
  "1596": {
    "subqueries": [
      "What are the essential nutrients and resources animals need for survival?",
      "How do these requirements vary among different species of animals?",
      "In what ways can environmental factors influence an animal's basic needs? "
    ]
  },
  "7-871": {
    "subqueries": [
      "What are the different states of matter and how do they typically change from one state to another?",
      "How does heat affect the molecular movement in a substance, potentially leading to a change in its state of matter?",
      "Can you provide an example where applying or removing heat results in a visible change in the state of matter?"
    ]
  },
  "9-865": {
    "subqueries": [
      "What are the four seasons in the northern hemisphere?",
      "Which season follows spring in the sequence of the four seasons in the northern hemisphere?",
      "During which months does this subsequent season occur in the northern hemisphere?"
    ]
  },
  "1736": {
    "subqueries": [
      "What causes the apparent motion of stars in the sky during the night?",
      "How does Earth's rotation affect the position of stars relative to the horizon over time?",
      "Can you provide a specific example or scenario illustrating how this movement appears from an observer on Earth?"
    ]
  },
  "9-740": {
    "subqueries": [
      "What are some examples of nonrenewable materials?",
      "What factors should the man consider when choosing a nonrenewable material for his project?",
      "How can the chosen nonrenewable material meet the specific requirements or goals of the project? "
    ]
  },
  "7-518": {
    "subqueries": [
      "What is the primary substance bees collect from flowers?",
      "Describe the process by which bees transform this collected substance.",
      "What is the final product created by bees through this transformation process?"
    ]
  },
  "871": {
    "subqueries": [
      "What causes water vapor to cool at night?",
      "How does the temperature change affect the state of water vapor?",
      "What are the observable effects or outcomes when water vapor cools overnight? "
    ]
  },
  "7-730": {
    "subqueries": [
      "What are the main techniques used in fish reproduction?",
      "How does each technique work and what species of fish is it suitable for?",
      "What are the benefits and limitations associated with each fish reproduction technique?"
    ]
  },
  "883": {
    "subqueries": [
      "What are the typical dietary habits of rabbits?",
      "What types of food do wild and domesticated rabbits commonly consume?",
      "Are there any specific foods or plants known to be particularly appealing or necessary for rabbits?"
    ]
  },
  "9-84": {
    "subqueries": [
      "How does increased food intake affect an animal's energy levels and metabolism?",
      "What are the potential short-term physiological changes in an animal due to increased food intake?",
      "What long-term health impacts can arise from sustained increases in an animal's food intake? "
    ]
  },
  "7-603": {
    "subqueries": [
      "What are the different phases of the moon?",
      "How frequently does each phase of the moon occur in relation to one another?",
      "Under what conditions do both a full moon and a crescent moon appear over time?"
    ]
  },
  "1840": {
    "subqueries": [
      "What are decomposers and how do they function in ecosystems?",
      "How does the process of decomposition contribute to nutrient recycling in ecosystems?",
      "Can you provide examples of decomposers involved in breaking down dead organisms and returning nutrients to the soil?"
    ]
  },
  "7-996": {
    "subqueries": [
      "What defines \"something living\"?",
      "How is \"sustenance\" typically characterized for living things?",
      "Why would a living thing likely require sustenance?"
    ]
  },
  "7-315": {
    "subqueries": [
      "What is the value of the moon's gravitational acceleration on its surface?",
      "How does the moon's gravitational force compare to Earth's in terms of strength and effects on objects?",
      "What are the primary factors that determine the moon's gravitational pull? "
    ]
  },
  "8-249": {
    "subqueries": [
      "What is chlorophyll and where is it found in plants?",
      "How does chlorophyll contribute to photosynthesis?",
      "Which specific part of the electromagnetic spectrum can chlorophyll absorb, enabling plants to perform photosynthesis?"
    ]
  },
  "7-578": {
    "subqueries": [
      "What is the size or diameter of the moon?",
      "What are the main features and surface characteristics of the moon?",
      "How does the moon interact with other celestial bodies, such as Earth? "
    ]
  },
  "7-791": {
    "subqueries": [
      "What are the primary processes involved in plant growth?",
      "How do environmental factors influence these processes?",
      "In what ways do internal biological mechanisms support and regulate plant growth? "
    ]
  },
  "7-452": {
    "subqueries": [
      "What are the primary functions of plant lights?",
      "How do plant lights benefit indoor gardening or plants lacking natural sunlight?",
      "In what environments or situations are plant lights most commonly used? "
    ]
  },
  "1117": {
    "subqueries": [
      "What are the specific conditions or context when a car is described as \"driving off\" at night?",
      "What factors or elements contribute to the significance of a car driving off during nighttime?",
      "How does the time (night) influence the perception or potential implications of a car driving away?"
    ]
  },
  "153": {
    "subqueries": [
      "What are the common pollutants typically released by mills into nearby water bodies?",
      "How do these specific pollutants affect aquatic ecosystems and water quality?",
      "What historical evidence or reports indicate that a particular mill in this area is responsible for such pollution?"
    ]
  },
  "362": {
    "subqueries": [
      "What are some key characteristics of nonrenewable resources?",
      "How do different actions or behaviors influence the consumption rate of nonrenewable resources?",
      "Which specific actions have been shown to effectively reduce the depletion of nonrenewable resources? "
    ]
  },
  "215": {
    "subqueries": [
      "What environmental conditions typically cause a rabbit to develop thicker fur?",
      "How does a rabbit's fur change with the seasons?",
      "Are there specific breeds of rabbits known for having particularly thick fur? "
    ]
  },
  "9-789": {
    "subqueries": [
      "What are some common applications of ceramics in the field of electricity?",
      "How do the properties of ceramics make them suitable for use in electrical applications?",
      "Can you provide examples of specific types of ceramics that are commonly used in electrical components or systems? "
    ]
  },
  "9-878": {
    "subqueries": [
      "What are the common uses of a tape measure?",
      "How does a tape measure function or operate to fulfill its purposes?",
      "In what specific scenarios or fields is a tape measure most beneficial? "
    ]
  },
  "7-570": {
    "subqueries": [
      "What happens to a mosquito's body after it dies?",
      "How does sucking affect a dead mosquito when it comes in contact with mud?",
      "What are the effects or implications of a dead mosquito being absorbed by mud?"
    ]
  },
  "9-421": {
    "subqueries": [
      "What is the initial effect of pushing the pedals in a circular motion while on top of a bicycle?",
      "How does this action affect the rotation and stability of the wheels?",
      "What are the potential consequences for balance and control when pedaling while not seated? "
    ]
  },
  "9-68": {
    "subqueries": [
      "What sensory abilities does a bat possess that help it navigate?",
      "How do these sensory abilities function in guiding a bat's flight path?",
      "Are there any external factors or environmental cues that influence how bats maintain their course?"
    ]
  },
  "9-648": {
    "subqueries": [
      "What is the role of chlorophyll in trees?",
      "How does chlorophyll contribute to a tree's ability to produce its own food?",
      "Why is it said that trees \"make their own\" food? "
    ]
  },
  "719": {
    "subqueries": [
      "What are the main categories of sources from which food is derived?",
      "How does agriculture contribute to food production?",
      "What role do other methods (such as fishing or hunting) play in providing food?"
    ]
  },
  "669": {
    "subqueries": [
      "What are common sources of noise when shuffling around a room in an apartment?",
      "What materials or products can effectively dampen or block sound transmission between floors?",
      "How do you install or use these materials/products to minimize noise from being heard by neighbors below?  "
    ]
  },
  "7-195": {
    "subqueries": [
      "What specific characteristics define a region as \"cold\" in terms of climate?",
      "How do climatic conditions differentiate between the \"north\" and the \"midnorth\" regions?",
      "What are the potential outcomes or scenarios when contrasting climates (cold north vs. warm midnorth) interact or coexist?"
    ]
  },
  "8-353": {
    "subqueries": [
      "What specific behavior do adult salmon exhibit when returning from their time in the ocean?",
      "Where do adult salmon typically return to after spending years in the ocean?",
      "How does the ability to locate their birthplace impact the survival and reproduction of adult salmon? "
    ]
  },
  "8-314": {
    "subqueries": [
      "What are the steps involved in preparing dinner using this method?",
      "How does turning on the stove contribute to cooking the meat?",
      "What changes occur to the meat as heat is applied and why do they happen?  "
    ]
  },
  "1724": {
    "subqueries": [
      "What are the defining characteristics of a moth?",
      "How does a moth differ from other insects, such as butterflies or beetles?",
      "In what environments and conditions do moths typically live and thrive?"
    ]
  },
  "9-432": {
    "subqueries": [
      "What geographical features define an island?",
      "What natural processes can lead to the formation of islands?",
      "What human activities or interventions might contribute to creating artificial islands?"
    ]
  },
  "1193": {
    "subqueries": [
      "What are the optimal growing conditions for a palm tree?",
      "Which climates or environments typically do not meet these conditions?",
      "Are there specific regions where palm trees struggle to thrive due to unsuitable conditions? "
    ]
  },
  "9-819": {
    "subqueries": [
      "What are the chemical properties of glucose that influence its solubility?",
      "In which types of solvents is glucose known to dissolve readily?",
      "How does temperature affect the solubility of glucose?  "
    ]
  },
  "7-236": {
    "subqueries": [
      "What are the primary sources of sediment near the shed's location?",
      "How do environmental factors (e.g., wind, water flow) contribute to sediment accumulation in this area?",
      "Are there any human activities or structural changes around the shed that have influenced sediment buildup? "
    ]
  },
  "1760": {
    "subqueries": [
      "What is the relationship between sunlight intensity and the performance of solar panels?",
      "At what times of day is sunlight intensity typically at its peak?",
      "How do factors like weather conditions, geographic location, and seasonal changes affect solar panel efficiency throughout the day?"
    ]
  },
  "9-1110": {
    "subqueries": [
      "What is electrical current and how does it flow through a wire?",
      "How does the resistance of a wire affect its temperature when an electrical current passes through it?",
      "What physical principles explain why a wire heats up due to the passage of electrical current?"
    ]
  },
  "1641": {
    "subqueries": [
      "What is the definition of \"gears grinding\" in a mechanical context?",
      "How does friction affect the temperature of interacting surfaces in contact?",
      "Are there any changes to the noise level or vibration when gears are grinding against each other, and how can these be measured? "
    ]
  },
  "9-85": {
    "subqueries": [
      "What natural processes contribute to changes in Earth's surface over time?",
      "How do human activities impact and alter the physical landscape of our planet?",
      "In what ways can extraterrestrial events affect or modify Earth's surface features? "
    ]
  },
  "9-600": {
    "subqueries": [
      "What are some common adaptations or behaviors prey animals use to evade predators?",
      "How do these adaptations or behaviors increase the chances of surviving encounters with predators?",
      "In what ways does increased survival from predation influence a prey animal's ability to find and successfully mate? "
    ]
  },
  "1214": {
    "subqueries": [
      "What are the components or types of radiation found in sunlight?",
      "How does each component or type contribute to its role as a source of energy?",
      "In what ways do humans and other organisms utilize these components or types for various purposes?  "
    ]
  },
  "832": {
    "subqueries": [
      "What are the primary components or materials involved in the formation of peat?",
      "In what type of environment or conditions does peat typically form?",
      "Over what time period does the transformation process occur that results in peat? "
    ]
  },
  "7-73": {
    "subqueries": [
      "What are the primary environmental conditions that trigger a bear's hibernation?",
      "How does hibernation benefit a bear during these periods?",
      "What physiological changes occur in a bear to support hibernation?  "
    ]
  },
  "9-935": {
    "subqueries": [
      "What are the specific statements or options provided under \"the following\"?",
      "What criteria or facts should be used to evaluate the truthfulness of each statement?",
      "Are there any additional contexts, definitions, or conditions that need to be considered when determining which statement is true?"
    ]
  },
  "298": {
    "subqueries": [
      "What are some common methods used for preserving natural resources?",
      "How do these methods impact the environment and resource sustainability?",
      "Can you provide examples of successful implementations of these preservation strategies?  "
    ]
  },
  "8-459": {
    "subqueries": [
      "What are the specific scenarios provided for comparison?",
      "What criteria define a \"ugly\" TV screen (e.g., brightness, color accuracy, resolution)?",
      "How do each of the given scenarios impact the criteria identified for an ugly TV screen?"
    ]
  },
  "289": {
    "subqueries": [
      "What are the primary abilities of a jellyfish?",
      "Are there any known limitations or exclusions in these abilities?",
      "In what environments or situations might a jellyfish's abilities be limited?"
    ]
  },
  "8-490": {
    "subqueries": [
      "What are the specific soil conditions required for growing a rosebush?",
      "How much sunlight and water does a rosebush need to thrive?",
      "Are there any particular temperature ranges or seasonal considerations necessary for rosebush growth?"
    ]
  },
  "9-198": {
    "subqueries": [
      "What factors influence how large an object appears to an observer?",
      "How does distance affect the apparent size of an object in relation to the viewer's perspective?",
      "At what specific distances (close, medium, or far) might an object appear largest, and why? "
    ]
  },
  "7-839": {
    "subqueries": [
      "What natural forces are commonly responsible for creating canyons?",
      "How do these forces specifically contribute to the formation of a canyon over time?",
      "Can you provide examples of canyons that were formed primarily due to one or more specific strong forces? "
    ]
  },
  "7-1059": {
    "subqueries": [
      "What natural processes contribute to the formation of canyons like the Grand Canyon?",
      "How has the geology of the region influenced the depth and size of the Grand Canyon over time?",
      "What role have climatic factors played in shaping the current dimensions of the Grand Canyon?"
    ]
  },
  "9-267": {
    "subqueries": [
      "How does heat affect the molecular structure of matter?",
      "What are the different states of matter and how can they change with temperature variations?",
      "Can you describe specific examples where heat causes a phase transition in matter?"
    ]
  },
  "140": {
    "subqueries": [
      "What characteristics define something as supporting living things?",
      "How do we determine if a place or environment can serve as a home for living things?",
      "Can you list examples of environments or objects that neither support nor house living organisms?"
    ]
  },
  "9-453": {
    "subqueries": [
      "What types of items do chipmunks typically gather?",
      "How do these gathered items assist the chipmunk in terms of storage or future use?",
      "In what way does this behavior contribute to plant dispersal? "
    ]
  },
  "9-1005": {
    "subqueries": [
      "What are some characteristics or behaviors of dogs that might appeal more to a young boy compared to those of cats?",
      "How do cultural or societal influences shape a child's preference for dogs over cats?",
      "Could personal experiences or interactions with dogs and cats play a role in shaping the boy's preference?"
    ]
  },
  "8-364": {
    "subqueries": [
      "What biological process is occurring in a girl who is turning sixteen and experiencing changes to her body, such as the development of her breasts?",
      "What are some common physical changes that occur during this biological process for females entering adolescence?",
      "How do these changes signify the transition from childhood to adulthood?"
    ]
  },
  "9-371": {
    "subqueries": [
      "What changes occur in a liquid when it is heated?",
      "How does temperature affect the solubility of solids in liquids?",
      "Is there a relationship between the properties of a heated liquid and its ability to dissolve or break down solids? "
    ]
  },
  "668": {
    "subqueries": [
      "What are the dates and times of sunrise and sunset throughout the year at your specific location?",
      "How does the duration of daylight change with the seasons in your location?",
      "On which day(s) is the shortest period between sunrise and sunset, indicating the least amount of daylight available? "
    ]
  },
  "1593": {
    "subqueries": [
      "What are some environmental conditions where a rock could serve as a suitable shelter?",
      "What characteristics of a rock make it viable for use as a shelter?",
      "Who or what might use a rock as a shelter, and under what circumstances?"
    ]
  },
  "1645": {
    "subqueries": [
      "What are the primary mechanisms through which substances absorb sunlight?",
      "Which materials or structures are most effective at absorbing sunlight and why?",
      "How does absorbed sunlight convert into other forms of energy, such as heat or electricity?  "
    ]
  },
  "7-866": {
    "subqueries": [
      "What is considered the last month of the year?",
      "How does the calendar align between the northern and southern hemispheres?",
      "Which seasons correspond to winter, spring, summer, and autumn in the southern hemisphere?"
    ]
  },
  "9-455": {
    "subqueries": [
      "What is an anemometer and what does it measure?",
      "Under what environmental conditions does an anemometer typically record higher readings?",
      "What weather scenarios are likely to provide these conditions for an anemometer? "
    ]
  },
  "1407": {
    "subqueries": [
      "What types of risks or hazards are associated with the careless handling of chemicals?",
      "How can improper storage or disposal practices contribute to these risks?",
      "What safety protocols should be followed to prevent accidents resulting from the careless handling of chemicals?"
    ]
  },
  "660": {
    "subqueries": [
      "Which planet is associated with the invention of television?",
      "What are the key heavenly objects (e.g., stars, planets) in proximity to this planet?",
      "Among these heavenly objects, which one is closest to the specified planet? "
    ]
  },
  "9-559": {
    "subqueries": [
      "What factors determine whether a cub in a litter will grow up healthy?",
      "How do environmental conditions affect the likelihood of injuries like cuts in young lions?",
      "What natural behaviors or circumstances could lead to a cub sustaining a cut on its paw? "
    ]
  },
  "364": {
    "subqueries": [
      "What are the four seasons in the southern hemisphere?",
      "How do the months of winter align in the southern hemisphere compared to the northern hemisphere?",
      "In which month does December fall, and what season corresponds to this time in the southern hemisphere?"
    ]
  },
  "7-276": {
    "subqueries": [
      "What are the common triggers for sunlight allergies?",
      "Which places typically have high exposure to direct sunlight?",
      "Are there any specific environments or locations known for minimal sunlight exposure that might be suitable for someone with a sunlight allergy?"
    ]
  },
  "1732": {
    "subqueries": [
      "What are the four seasons of the year in order?",
      "Which season immediately follows spring in this sequence?",
      "After which subsequent season does spring return?"
    ]
  },
  "9-919": {
    "subqueries": [
      "What are the primary roles and functions associated with the human skeletal system?",
      "How does the skeletal system contribute to movement in conjunction with other body systems?",
      "In what ways does the skeletal system provide protection for vital organs in the body?"
    ]
  },
  "7-758": {
    "subqueries": [
      "What are the effects of sunlight on the temperature of water in an open container over time?",
      "How does evaporation occur and what factors influence its rate in this scenario?",
      "Are there any other physical or chemical changes that can happen to water when exposed to sunlight for four hours?"
    ]
  },
  "1202": {
    "subqueries": [
      "What are the primary functions of a plant's stem?",
      "How does the structure of a stem support its functions in a plant?",
      "In what ways do different types of plants have variations in their stems, and why?  "
    ]
  },
  "9-825": {
    "subqueries": [
      "What specific information or data is needed from a scale?",
      "In what context or scenario is the scale being used (e.g., scientific experiment, cooking, industrial measurement)?",
      "What are the potential consequences of not using a scale in this situation? "
    ]
  },
  "9-54": {
    "subqueries": [
      "What factors contribute to the rate of weathering experienced by a stone?",
      "How do different environments affect the weathering process of stones?",
      "In which type of environment would a stone likely undergo the most weathering, and why?  "
    ]
  },
  "9-904": {
    "subqueries": [
      "What are the primary functions of the cell membrane?",
      "How does the structure of the cell membrane contribute to its function in protecting the cell?",
      "What types of substances or factors is the cell membrane designed to keep out?"
    ]
  },
  "7-643": {
    "subqueries": [
      "What are the characteristics of brackish water?",
      "Where do freshwater and saltwater typically meet or mix?",
      "What environmental conditions support the presence of brackish water in those locations? "
    ]
  },
  "9-58": {
    "subqueries": [
      "What are the typical surface characteristics of a wooden floor compared to a carpeted floor?",
      "How do these surface characteristics affect friction when sliding an object across them?",
      "Why does reduced friction make it easier to slide a chair over one type of flooring compared to another?"
    ]
  },
  "9-23": {
    "subqueries": [
      "How does eating a watermelon affect a bear's behavior or physiology?",
      "Why might a bear travel to several areas in the forest during the day after consuming food like a watermelon?",
      "What potential effects can the movement of a bear through various parts of the forest have on the surrounding environment and other wildlife?"
    ]
  },
  "7-806": {
    "subqueries": [
      "What are white blood cells and what role do they play in the human body?",
      "How many different types of white blood cells exist, and what are their specific functions?",
      "What can cause changes in white blood cell counts, and how are these abnormalities diagnosed?  "
    ]
  },
  "9-687": {
    "subqueries": [
      "What is the typical impact of physical disturbance on an ant colony?",
      "How does the structure and organization of an ant colony contribute to its resilience or vulnerability when disturbed?",
      "What are common survival strategies ants use when their habitat is disrupted?"
    ]
  },
  "7-383": {
    "subqueries": [
      "What types of foods are high in dietary fiber?",
      "How does dietary fiber contribute to digestive health and regularity?",
      "Can you provide examples of specific foods that are recommended for adding fiber into a diet? "
    ]
  },
  "8-277": {
    "subqueries": [
      "How does AIDS affect the immune system?",
      "What is the role of CD4 cells in the human body?",
      "In what ways can a weakened immune system lead to increased vulnerability to infections and diseases?"
    ]
  },
  "7-204": {
    "subqueries": [
      "What are some examples of creatures that use bioluminescence?",
      "How do these creatures typically use their ability to produce light to attract prey?",
      "Are there specific environments or conditions where this method of attracting prey is more effective? "
    ]
  },
  "9-657": {
    "subqueries": [
      "What is the average growth rate of the celestial body in terms of its diameter per year?",
      "How does this increase in diameter affect the volume and therefore the mass of the celestial body over time?",
      "Assuming uniform density, what would be the estimated total increase in mass after a hundred years?"
    ]
  },
  "1868": {
    "subqueries": [
      "What are the different types of scales available for measuring weight?",
      "How does each type of scale function to measure weight accurately?",
      "In what contexts or situations is a particular type of scale most appropriately used?"
    ]
  },
  "7-1039": {
    "subqueries": [
      "What is the primary function of the respiratory system?",
      "How does the respiratory system facilitate gas exchange in the body?",
      "In what ways does the respiratory system contribute to maintaining homeostasis?"
    ]
  },
  "7-537": {
    "subqueries": [
      "What is the mathematical formula used to calculate speed?",
      "Which variables are involved in this formula and what do they represent?",
      "How can these variables be measured or determined in a real-world scenario? "
    ]
  },
  "7-672": {
    "subqueries": [
      "What is meant by \"natural resources\"?",
      "Can you list examples of natural resources?",
      "How are these natural resources typically sourced or obtained from nature? "
    ]
  },
  "7-520": {
    "subqueries": [
      "What does \"burning away the darkness\" metaphorically represent or refer to in various contexts?",
      "How can introducing even a small amount of light symbolize overcoming challenges or negativity?",
      "Can you provide examples where a minimal positive influence has led to significant change or improvement? "
    ]
  },
  "7-437": {
    "subqueries": [
      "What are some common products or substances made using leaves?",
      "How do leaves contribute to the production processes of these items?",
      "Are there any specific types of leaves that are particularly important for certain productions?"
    ]
  },
  "9-579": {
    "subqueries": [
      "What characteristics define a \"stately\" tree?",
      "What specific conditions are found in a \"dense forest\" environment?",
      "How do trees like a red maple receive support or stability in their natural habitat?"
    ]
  },
  "8-402": {
    "subqueries": [
      "What is typically inside a beach ball?",
      "How does the structure of a beach ball allow for contents to escape when it bursts?",
      "Are there any other materials or gases present in or around a beach ball that could potentially escape if it bursts? "
    ]
  },
  "951": {
    "subqueries": [
      "What are some common sources of pollution?",
      "How does one particular source contribute to environmental or health issues?",
      "Are there any specific examples or case studies illustrating the impact of this source? "
    ]
  },
  "8-197": {
    "subqueries": [
      "What are nonrenewable resources?",
      "Can you list some examples of nonrenewable resources?",
      "Which energy sources or materials do not fall under the category of nonrenewable resources? "
    ]
  },
  "1949": {
    "subqueries": [
      "What positions do the Earth, Moon, and Sun need to be in for a full moon to occur?",
      "How does sunlight interact with the Moon during this alignment to create a full moon appearance from Earth's perspective?",
      "Are there any other factors or phenomena that contribute to the visibility of a full moon?"
    ]
  },
  "7-302": {
    "subqueries": [
      "What is crop rotation and what are its primary purposes?",
      "How does crop rotation benefit soil health and fertility?",
      "What are some common examples of crop rotation practices used in agriculture?"
    ]
  },
  "8-75": {
    "subqueries": [
      "What are the basic principles or techniques involved in riding a bike?",
      "Why is it important for feet to stay on the pedals while learning to ride a bike?",
      "How does keeping feet on the pedals affect balance and control during bike riding? "
    ]
  },
  "1956": {
    "subqueries": [
      "What are the different ways mammals generally reproduce?",
      "Specifically, how do rodents like mice reproduce?",
      "Are there any unique aspects of mouse births compared to other small mammals? "
    ]
  },
  "9-342": {
    "subqueries": [
      "What natural processes contribute to the decomposition of rotting grain?",
      "How do these processes affect the soil composition over time?",
      "What changes might occur in the ground as a result of the decomposition process?  "
    ]
  },
  "7-821": {
    "subqueries": [
      "What is the effect of adding lemon juice to water on its taste?",
      "How does the acidity level change when lemon juice is mixed with water?",
      "Are there any potential health benefits or drawbacks from consuming lemon juice in water?  "
    ]
  },
  "7-933": {
    "subqueries": [
      "What factors determine the degree of bumpiness on a road?",
      "How does the level of bumpiness affect driving conditions or vehicle wear and tear compared to a smoother road?",
      "In what ways might drivers perceive or describe differences between a bumpy road and a smooth road? "
    ]
  },
  "9-1007": {
    "subqueries": [
      "What types of environmental hazards does shelter typically protect humans from?",
      "How do different materials used in shelters contribute to their protective capabilities?",
      "In what ways do the design and structure of a shelter enhance human protection against potential threats?  "
    ]
  },
  "1209": {
    "subqueries": [
      "What types of environmental conditions are considered \"bad weather\" for animals?",
      "How do different species adapt or respond to these adverse weather conditions?",
      "What specific structures, behaviors, or physical adaptations help animals protect themselves from bad weather?"
    ]
  },
  "7-428": {
    "subqueries": [
      "What are tree rings and how do they form?",
      "How can tree rings provide information about a tree's age?",
      "In what ways can tree rings be used to understand historical climate conditions? "
    ]
  },
  "1483": {
    "subqueries": [
      "What common methods or tools are used for supporting roses?",
      "In what situations might roses require additional support when they are growing?",
      "What types of materials or structures can effectively prop up roses? "
    ]
  },
  "9-474": {
    "subqueries": [
      "What are some examples of resources that are not manmade?",
      "Where do these non-manmade resources typically originate or exist in nature?",
      "Are there specific environments or locations where these natural resources cannot be found?"
    ]
  },
  "9-398": {
    "subqueries": [
      "What are the common prey or food sources for black bears in Alaska?",
      "How do black bears typically hunt or forage for their meals?",
      "Are there specific times of year when black bears focus on certain types of food? "
    ]
  },
  "7-283": {
    "subqueries": [
      "What are the common types of rocks known to contain iron (Fe)?",
      "What physical or chemical tests can be conducted on a rock sample to detect the presence of iron?",
      "How do geological factors such as location and formation process influence the likelihood of a rock containing iron? "
    ]
  },
  "8-370": {
    "subqueries": [
      "What are the different surfaces or conditions listed where the ball could potentially fall?",
      "Are there any environmental factors (e.g., air resistance, wind) affecting each condition that need to be considered when comparing falling speeds?",
      "How does gravity interact with these surfaces or conditions in terms of acceleration and deceleration during the fall?"
    ]
  },
  "304": {
    "subqueries": [
      "What is the primary function of a rain gutter in managing rainwater?",
      "How does directing water from a rain gutter onto bare ground affect soil and vegetation?",
      "What potential issues could arise from using a spout to drain rainwater directly onto bare ground?  "
    ]
  },
  "9-502": {
    "subqueries": [
      "What meteorological processes lead to the formation of dark clouds associated with storms?",
      "How do these cloud formations typically precede a storm?",
      "What environmental or atmospheric conditions contribute to the development of these specific types of clouds? "
    ]
  },
  "1377": {
    "subqueries": [
      "What are the primary environmental conditions found in the Arctic region?",
      "How do these environmental conditions influence animal adaptations and survival strategies?",
      "Which specific animals are known to thrive under these Arctic conditions, and what adaptations allow them to succeed? "
    ]
  },
  "9-53": {
    "subqueries": [
      "What are the physical processes involved when water boils?",
      "How does heating affect these processes in the context of water boiling?",
      "What type of energy transfer occurs when water is boiled on a stove?"
    ]
  },
  "1987": {
    "subqueries": [
      "What are national parks and what is their primary purpose?",
      "How do national parks differ from other types of protected areas such as wildlife sanctuaries or nature reserves?",
      "What are some examples of national parks around the world, and what unique features or attractions do they offer?"
    ]
  },
  "9-38": {
    "subqueries": [
      "What are some ways individuals can minimize pollution or littering while traveling?",
      "How does disposing of trash properly, such as keeping fast food bags in a vehicle instead of discarding them from a moving car, contribute to environmental protection?",
      "What specific types of waste (e.g., fast food packaging) have significant impacts on the environment if not disposed of correctly?"
    ]
  },
  "1152": {
    "subqueries": [
      "What creative use of trash was demonstrated in the final scene of \"Back to the Future\"?",
      "How does this type of use of materials relate to concepts like recycling or upcycling?",
      "What term best describes the process of using waste materials creatively and innovatively, as seen in the movie?"
    ]
  },
  "9-911": {
    "subqueries": [
      "What factors determine whether a habitat can support its animal population?",
      "How do changes in a habitat affect the resources available for its animal inhabitants?",
      "What are some typical responses or behaviors of animals when they find their current habitat unsupportive?"
    ]
  },
  "9-1076": {
    "subqueries": [
      "What are the physical effects on the ground caused by the impact of atomic bombs?",
      "What other natural or man-made events cause similar ground movements as those from atomic bomb impacts?",
      "How do these comparisons help us understand the magnitude and nature of the ground movement from an atomic explosion?"
    ]
  },
  "1700": {
    "subqueries": [
      "What are the primary components of a stove?",
      "How do these components function to produce heat?",
      "What types of fuel or energy sources are typically used by stoves to generate heat?"
    ]
  },
  "7-106": {
    "subqueries": [
      "What part of a tree provides structural stability?",
      "How do trees distribute nutrients throughout their structure?",
      "What role does this part play in both providing stability and nutrient distribution?"
    ]
  },
  "9-65": {
    "subqueries": [
      "What are the main components involved in a running car engine?",
      "How does each of these components contribute to the operation of the engine?",
      "What changes occur within the engine when it is running compared to when it is off?"
    ]
  },
  "1631": {
    "subqueries": [
      "What are the necessary safety precautions when standing near a campfire?",
      "How close is it safe to stand to a campfire without risking injury or discomfort?",
      "What environmental conditions can affect how one should behave near a campfire?  "
    ]
  },
  "9-775": {
    "subqueries": [
      "How many days does it take for the Moon to complete one full orbit around the Earth?",
      "During this orbital period, how often do the various phases of the Moon occur?",
      "Are there any variations or exceptions in the frequency of these phases due to celestial mechanics? "
    ]
  },
  "1213": {
    "subqueries": [
      "What are some examples of animals that require specific environmental conditions to survive?",
      "How does temperature affect the survival and behavior of these animals?",
      "Can you identify a specific animal that relies on warmth as part of its essential habitat requirements? "
    ]
  },
  "8-241": {
    "subqueries": [
      "What types of plants do deers typically consume?",
      "Are there any specific parts of plants (e.g., leaves, twigs) that deers prefer to eat?",
      "Does the diet of deers vary based on their habitat or season? "
    ]
  },
  "9-300": {
    "subqueries": [
      "How many hours are there in a 24-hour day?",
      "How many minutes are there in one hour?",
      "How do you calculate the total number of minutes in a 24-hour period using the answers to the first two questions?"
    ]
  },
  "1470": {
    "subqueries": [
      "What celestial body is commonly referred to as \"the moon\"?",
      "What kind of gravitational relationship does this celestial body have with Earth?",
      "How does this celestial body's orbit affect phenomena observed on Earth, such as tides and phases?"
    ]
  },
  "9-515": {
    "subqueries": [
      "What factors influence speed in the given context?",
      "What determines acceleration in the given scenario?",
      "How do specific changes or conditions affect both speed and acceleration simultaneously?"
    ]
  },
  "740": {
    "subqueries": [
      "What are the different types of weathering processes?",
      "How do these weathering processes affect rocks and minerals over time?",
      "In what ways do environmental factors influence the rate and extent of weathering? "
    ]
  },
  "9-476": {
    "subqueries": [
      "What factors influence a person's ability to see clearly while driving?",
      "How do different individuals' vision conditions compare when considering those factors (e.g., nearsightedness, farsightedness, astigmatism)?",
      "Among the people being considered for driving to work, who has the most favorable combination of these visual characteristics and corrective measures (such as prescription glasses or contacts)?"
    ]
  },
  "9-242": {
    "subqueries": [
      "What do hummingbirds typically feed on from plants?",
      "How do some plants make it easier for hummingbirds to access their nectar?",
      "In what way might a plant benefit while a hummingbird sips its nectar?"
    ]
  },
  "9-385": {
    "subqueries": [
      "What factors can lead to a decrease in the predator population?",
      "How does a reduction in predator numbers affect prey populations?",
      "What are the broader ecological impacts of changes in predator-prey dynamics? "
    ]
  },
  "7-1124": {
    "subqueries": [
      "What type of chemical reaction occurs within a battery to generate electrical energy?",
      "How does this generated electrical energy get converted into light in a flashlight?",
      "What role do the components inside a flashlight play in directing and controlling the produced light? "
    ]
  },
  "1064": {
    "subqueries": [
      "What are some effective strategies or actions individuals can take to protect the environment?",
      "How do communities and organizations contribute to environmental protection efforts?",
      "What role does government policy play in protecting the environment, and what measures should be implemented? "
    ]
  },
  "8-74": {
    "subqueries": [
      "What are some common sources of energy that humans can consume?",
      "How does each source provide energy to the body or system in which it is consumed?",
      "Are there specific conditions or factors that affect how effectively these energy sources can be utilized?"
    ]
  },
  "613": {
    "subqueries": [
      "What conditions make it difficult to see objects when it's dark outside?",
      "How does light affect the visibility of objects?",
      "Why might there be insufficient light available outdoors during nighttime? "
    ]
  },
  "7-845": {
    "subqueries": [
      "What are conductors and how do they facilitate the flow of electricity?",
      "Can you provide examples of common materials used as electrical conductors?",
      "How does the presence or absence of a conductor affect the ability of electricity to flow? "
    ]
  },
  "493": {
    "subqueries": [
      "What types of animals are native to or commonly found in the Sahara Desert?",
      "What specific environmental features (such as sand color and dune structures) are prevalent in the Sahara Desert that could affect an animal's ability to camouflage?",
      "Which animals have developed adaptations specifically for blending into these environmental features, and how effective are these adaptations?"
    ]
  },
  "9-1161": {
    "subqueries": [
      "What physiological process occurs in panting for animals such as dogs?",
      "How does sweating function in regulating body temperature in humans?",
      "In what ways are panting and sweating similar or different as methods of thermoregulation?"
    ]
  },
  "1939": {
    "subqueries": [
      "What are some effects or phenomena that magnetism can directly cause?",
      "How does magnetism interact with different materials, and what changes might it induce in them?",
      "In what ways can magnetic fields influence the behavior of charged particles? "
    ]
  },
  "7-497": {
    "subqueries": [
      "What is meant by \"the sun appears to move\"?",
      "Which celestial body's rotation affects this apparent movement?",
      "How does the rotation of this celestial body cause the sun to appear to move? "
    ]
  },
  "7-370": {
    "subqueries": [
      "What anatomical landmarks or points on the foot should be used to measure the distance from the big toe to the little toe?",
      "Which tools or methods can accurately measure this distance (e.g., measuring tape, digital calipers)?",
      "Are there specific techniques or guidelines for ensuring an accurate measurement of the length between these two toes?"
    ]
  },
  "9-958": {
    "subqueries": [
      "What are some examples of materials that can be burned to generate energy?",
      "How is electricity produced when a material is burned?",
      "What types of facilities or technologies utilize burning materials to produce electricity?"
    ]
  },
  "9-22": {
    "subqueries": [
      "What are the typical reasons or conditions under which a leaf falls from a tree?",
      "How does the process of a leaf falling relate to the life cycle and health of the tree?",
      "Are there any environmental or seasonal factors that influence when leaves fall from trees? "
    ]
  },
  "7-954": {
    "subqueries": [
      "What are the specific characteristics of plants native to a particular ecosystem?",
      "How can one identify and source seeds or specimens of these native plants?",
      "What methods and considerations are important for successfully sowing these native plants in their natural habitat?"
    ]
  },
  "7-393": {
    "subqueries": [
      "What specific anatomical features do swordbills possess that allow them to access nectar from long, narrow flowers?",
      "How do these features compare to those of other bird species that cannot reach the same type of flowers?",
      "Why might these differences in anatomy prevent other birds from accessing nectar in similar flowers?"
    ]
  },
  "9-288": {
    "subqueries": [
      "What are some major factors that contribute to change on a global scale?",
      "Can you provide historical examples where significant changes have occurred in the world due to these factors?",
      "How do current trends or events suggest that the world may continue to change in the future? "
    ]
  },
  "449": {
    "subqueries": [
      "What are telescopes primarily used for?",
      "Can you name some celestial objects or phenomena that are typically observed with a telescope?",
      "Are there specific features or capabilities of telescopes that make certain things better suited for observation through them? "
    ]
  },
  "7-4": {
    "subqueries": [
      "What are the main types of electron microscopes and how do they differ from each other?",
      "How does an electron microscope achieve higher magnification compared to a light microscope?",
      "What are the typical applications and limitations of using an electron microscope? "
    ]
  },
  "1454": {
    "subqueries": [
      "What are some common methods currently used to produce electricity?",
      "How do these common methods differ from other less frequently used methods?",
      "Can you identify and describe a method of producing electricity that is considered rare or uncommon? "
    ]
  },
  "1917": {
    "subqueries": [
      "What substances are commonly used for writing?",
      "Which animals have special adaptations or behaviors for dealing with specific environmental challenges?",
      "How can a common writing substance help an animal in its natural environment? "
    ]
  },
  "436": {
    "subqueries": [
      "What types of environments do geckos typically inhabit?",
      "Are there specific regions or countries where certain species of geckos are commonly found?",
      "In what kinds of habitats, such as forests, deserts, or urban areas, might one expect to encounter geckos?"
    ]
  },
  "9-793": {
    "subqueries": [
      "How does congregating together impact the behavior and interactions among members of a group of organisms?",
      "What are the potential benefits for individual organisms when they congregate in groups?",
      "In what ways can these collective behaviors increase the overall chances of survival for the group?"
    ]
  },
  "1472": {
    "subqueries": [
      "What types of animals typically eat insects?",
      "Are there any birds known for primarily eating insects?",
      "Do any mammals or reptiles include insects as a significant part of their diet?"
    ]
  },
  "7-738": {
    "subqueries": [
      "What specific factors contribute to beach erosion and degradation?",
      "How do human activities impact beaches negatively?",
      "What measures can be implemented to mitigate or prevent damage to beaches?"
    ]
  },
  "1686": {
    "subqueries": [
      "What types of food do rabbits typically eat?",
      "Are there any specific dietary restrictions or preferences for rabbits when it comes to their diet?",
      "How does the nutritional content of a rabbit's diet affect its health and well-being? "
    ]
  },
  "8-401": {
    "subqueries": [
      "What are some common materials used for insulation in buildings located in cold climates?",
      "How do these materials help in retaining heat within a structure?",
      "What factors should be considered when choosing an insulation material to ensure it is both effective and cost-efficient?"
    ]
  },
  "8-134": {
    "subqueries": [
      "What are the common methods or processes through which plants are transported from one location to another?",
      "How do human activities, such as trade and travel, contribute to the movement of plant species across different regions?",
      "In what ways can natural events like wind dispersal, animal migration, or water currents introduce new plant species to a place?"
    ]
  },
  "1417": {
    "subqueries": [
      "What are some transportation methods considered environmentally friendly?",
      "How do these methods compare in terms of carbon emissions and environmental impact?",
      "What practical steps can individuals take to incorporate these environmentally friendly transportation options into their daily lives? "
    ]
  },
  "7-174": {
    "subqueries": [
      "What are some examples of chemical changes?",
      "Under what conditions or with what types of substances do these chemical changes typically occur?",
      "What indicators signify that a chemical change has taken place?  "
    ]
  },
  "233": {
    "subqueries": [
      "What are the different types of friction?",
      "How does friction occur between two surfaces in contact?",
      "Can you identify a specific scenario where friction is commonly observed?"
    ]
  },
  "398": {
    "subqueries": [
      "What factors determine the pressure exerted on an animal?",
      "How does body size and shape affect the pressure experienced by an animal?",
      "Which types of environments or scenarios result in the least amount of pressure for animals? "
    ]
  },
  "9-349": {
    "subqueries": [
      "What happens during the process of evaporation when applied to a solution of water and minerals?",
      "What remains after water has evaporated from such a solution?",
      "What are these remaining substances commonly referred to as?"
    ]
  },
  "689": {
    "subqueries": [
      "What are the typical habitats where deer are commonly found?",
      "What environmental factors make these areas suitable for deer?",
      "Are there specific types of vegetation or food sources that attract deer to certain areas? "
    ]
  },
  "9-659": {
    "subqueries": [
      "What other living organisms besides humans have the ability to taste?",
      "What mechanisms or systems do these organisms use to detect flavors?",
      "Are there specific types of flavors that certain non-human species are particularly sensitive to?"
    ]
  },
  "8-372": {
    "subqueries": [
      "What conditions inside a greenhouse allow for flower growth during winter?",
      "How does a greenhouse mitigate the effects of cold and freezing weather on plants?",
      "In what ways can a greenhouse compensate for the lack of natural sunlight?"
    ]
  },
  "7-132": {
    "subqueries": [
      "What are the different ways volume is used as an indicator?",
      "In what contexts or fields is volume commonly measured and analyzed as an indicator?",
      "How does a change in volume typically influence or reflect changes within its context? "
    ]
  },
  "7-1003": {
    "subqueries": [
      "What is meant by \"tearing\" in this context?",
      "How is \"a whole\" defined or characterized when considering tearing?",
      "What are the effects of tearing on the structural, functional, or conceptual integrity of a whole?"
    ]
  },
  "7-303": {
    "subqueries": [
      "What are the components involved in completing an electrical circuit when switching on a light?",
      "How does turning on the switch affect these components and the flow of electricity?",
      "What potential outcomes or effects occur as a result of completing this electrical circuit?"
    ]
  },
  "866": {
    "subqueries": [
      "What are the different types of coral species and their characteristics?",
      "Where do various coral species typically live or thrive geographically?",
      "In what kind of marine environments or ecosystems can corals generally be found? "
    ]
  },
  "975": {
    "subqueries": [
      "What characteristics define \"large\" fins in terms of size and structure?",
      "In what types of organisms or vehicles are large fins typically found?",
      "What purposes do these large fins serve, and how do they benefit their respective entities? "
    ]
  },
  "9-287": {
    "subqueries": [
      "What are the options or items listed as potential solutions?",
      "What criteria define something as a \"solution\" in this context (e.g., problem-solving effectiveness, scientific definition)?",
      "Does any of the listed options meet the established criteria for being considered a solution? "
    ]
  },
  "9-694": {
    "subqueries": [
      "What are considered \"essential functionalities\" of a cell?",
      "How does delegation of these functionalities benefit cellular efficiency and survival?",
      "What mechanisms or structures allow a cell to delegate these essential functions effectively? "
    ]
  },
  "611": {
    "subqueries": [
      "What is the gravitational force on the Moon compared to Earth?",
      "How does gravity affect a person's weight on different celestial bodies?",
      "Does reduced gravity on the Moon cause objects to float or fall differently than on Earth?  "
    ]
  },
  "7-989": {
    "subqueries": [
      "What is the phenomenon called when a refraction of light splits into different colors?",
      "Under what conditions does this phenomenon typically occur?",
      "What types of surfaces or materials can cause this phenomenon to happen?"
    ]
  },
  "7-1035": {
    "subqueries": [
      "What does \"it\" refer to in the statement?",
      "Under what conditions or criteria can something be renewed?",
      "Are there any limitations or restrictions associated with the renewal process? "
    ]
  },
  "7-862": {
    "subqueries": [
      "What atmospheric conditions are typically associated with the appearance of grey clouds?",
      "How do weather patterns usually change when grey clouds begin to form in the sky?",
      "What type of weather or event commonly follows after the appearance of grey clouds?"
    ]
  },
  "7-978": {
    "subqueries": [
      "What are the primary chemical components of acid rain?",
      "How does acid rain chemically interact with different materials and ecosystems?",
      "What specific examples illustrate the impact of acid rain on buildings, forests, water bodies, and soil? "
    ]
  },
  "7-900": {
    "subqueries": [
      "What are some common effects of adding heat to substances?",
      "How does heat contribute to initiating a chemical reaction?",
      "Can you provide specific examples where adding heat leads to a chemical reaction?"
    ]
  },
  "1467": {
    "subqueries": [
      "What factors contribute to the intensity and characteristics of a hurricane while it is over water?",
      "How do land interactions, such as friction and terrain features, affect a hurricane's structure and strength?",
      "What are the typical changes observed in wind speed, rainfall patterns, and overall storm behavior when a hurricane moves from ocean to land? "
    ]
  },
  "212": {
    "subqueries": [
      "What type of glands do skunks possess?",
      "What substances are produced by these glands in skunks?",
      "For what purpose is this substance typically used by skunks? "
    ]
  },
  "27": {
    "subqueries": [
      "How do seeds attach themselves to the coat of an animal?",
      "What are the potential benefits for seeds when they adhere to an animal's coat?",
      "In what ways does this interaction contribute to seed dispersal and plant propagation?"
    ]
  },
  "1484": {
    "subqueries": [
      "What are the common environmental factors that could cause an animal to shed fur?",
      "How do changes in an animal's health or stress levels affect its shedding patterns?",
      "Are there specific life stages or physiological changes in animals that lead to increased fur shedding?"
    ]
  },
  "9-272": {
    "subqueries": [
      "What types of energy can a thermal conductor transmit?",
      "Through what mechanisms does a thermal conductor transfer energy?",
      "Are there specific materials or conditions under which a thermal conductor is particularly effective? "
    ]
  },
  "927": {
    "subqueries": [
      "What are white blood cells and what is their primary function in the body?",
      "How many different types of white blood cells exist, and what are they called?",
      "What are some common disorders or diseases associated with abnormalities in white blood cell counts? "
    ]
  },
  "9-847": {
    "subqueries": [
      "What is meant by \"pulse\" in this context (e.g., heart rate, electronic signal)?",
      "Under what conditions or factors does a pulse typically accelerate?",
      "How can an acceleration of the pulse be measured or observed? "
    ]
  },
  "7-457": {
    "subqueries": [
      "Which species are known for their ability to ride bicycles?",
      "What specific traits or adaptations do these species possess that enable bicycle riding?",
      "Are there any documented instances of non-human species successfully riding bicycles?"
    ]
  },
  "7-973": {
    "subqueries": [
      "What defines a species as having only one living member?",
      "How is the existence of such a species typically confirmed and documented by scientists?",
      "Can you provide examples or case studies of species that have been known to consist of just one living individual?"
    ]
  },
  "8-412": {
    "subqueries": [
      "What are some specific behaviors or activities that occur among animals during spring?",
      "How does spring affect animal migration patterns and reproductive cycles?",
      "In what ways do environmental changes in spring influence the availability of food for animals? "
    ]
  },
  "9-503": {
    "subqueries": [
      "What defines migration for animals?",
      "Which states are considered the northernmost regions where these animals might start their journey?",
      "During which segment of time do these animals typically migrate from the northernmost states to Texas?"
    ]
  },
  "1015": {
    "subqueries": [
      "What is transpiration and how does it occur in plants?",
      "How does transipation affect the water cycle within ecosystems?",
      "In what ways can transpiration impact environmental conditions such as humidity, temperature, and soil moisture levels?"
    ]
  },
  "801": {
    "subqueries": [
      "What is the context or process in which \"smoothing\" is applied?",
      "Under what conditions does smoothing typically occur?",
      "What are the expected outcomes or effects of smoothing occurring? "
    ]
  },
  "771": {
    "subqueries": [
      "What is potential energy and how is it stored?",
      "What is kinetic energy and what does it signify in terms of motion?",
      "Can you provide examples or scenarios where potential energy is converted into kinetic energy?  "
    ]
  },
  "9-677": {
    "subqueries": [
      "What does the term \"anthropogenic\" mean in the context of climate change?",
      "What are the primary human activities that contribute to anthropogenic climate change?",
      "How do these human activities lead to changes in the Earth's climate? "
    ]
  },
  "851": {
    "subqueries": [
      "What is the typical reproductive process used by birds?",
      "How do male and female birds contribute to reproduction?",
      "What are the stages involved in bird reproduction from mating to hatching?"
    ]
  },
  "8-98": {
    "subqueries": [
      "What are the different types of cloud precipitation?",
      "How does each type of cloud precipitation form?",
      "Can any of these types of cloud precipitation occur under specific weather conditions or atmospheric scenarios?"
    ]
  },
  "9-144": {
    "subqueries": [
      "What is the scientific definition of clouds?",
      "How do clouds form in the atmosphere?",
      "What are the different types and classifications of clouds?  "
    ]
  },
  "9-1112": {
    "subqueries": [
      "What are the characteristics and behaviors of electric particles?",
      "Which other entities or phenomena have been compared with electric particle behaviors in scientific literature or studies?",
      "How do we measure or evaluate similarity between the behaviors of different entities or phenomena?"
    ]
  },
  "655": {
    "subqueries": [
      "What is meant by \"the source\" in this context?",
      "In which categories or fields could a source provide direct information or items (e.g., agriculture, media, technology)?",
      "How can one determine if something comes directly from its identified source without intermediaries? "
    ]
  },
  "9-176": {
    "subqueries": [
      "What conditions are necessary for evaporation to occur?",
      "How can these conditions be created or simulated in a controlled environment (e.g., at home)?",
      "What observable changes or effects indicate that evaporation is taking place? "
    ]
  },
  "9-194": {
    "subqueries": [
      "What are the defining characteristics of a desert environment?",
      "How do these characteristics influence climate conditions?",
      "Which specific climate types are typically associated with deserts based on their environmental characteristics?"
    ]
  },
  "9-704": {
    "subqueries": [
      "What type of light source does a flashlight use?",
      "How is this light produced within the flashlight?",
      "In what ways can the emitted light from a flashlight be controlled or adjusted?  "
    ]
  },
  "9-522": {
    "subqueries": [
      "What does it mean for the Earth's Northern axis to be \"tilted away\" from the Sun?",
      "How does the tilt of the Earth's axis affect seasonal changes in daylight duration?",
      "During which season or astronomical event does the Northern Hemisphere experience its axis being tilted away from the Sun?"
    ]
  },
  "7-168": {
    "subqueries": [
      "What is the position of the Earth relative to the Sun at 12:00 PM local time?",
      "How does the observer's location on Earth (latitude, longitude) affect their perception of where the Sun appears in the sky at noon?",
      "Does daylight saving time or any regional time adjustments impact the actual solar time when determining the position of the sun?"
    ]
  },
  "7-481": {
    "subqueries": [
      "What specific needs do begonias have in terms of water and care?",
      "How does daily watering with a hose affect begonias' health or growth?",
      "What outcomes are typically expected when maintaining such a watering schedule for begonias? "
    ]
  },
  "7-717": {
    "subqueries": [
      "What role do squirrels play in their ecosystem regarding plant life?",
      "How do squirrels interact with seeds and nuts in their environment?",
      "What is the impact of squirrels' actions on the distribution and growth of plants?  "
    ]
  },
  "9-711": {
    "subqueries": [
      "What are the primary components of a cow's diet?",
      "Which type of human dietary patterns focus on similar food sources as cows (e.g., plant-based diets)?",
      "How do the nutritional needs and digestive processes of humans compare to those of cows when consuming these types of foods?"
    ]
  },
  "8-237": {
    "subqueries": [
      "What specific health metrics or indicators are being considered for determining \"healthiness\" (e.g., BMI, cholesterol levels, blood pressure)?",
      "What are the lifestyle factors and habits (such as diet, exercise, smoking, alcohol consumption) of each individual?",
      "Are there any known medical conditions or genetic predispositions affecting either individual's health?"
    ]
  },
  "8-148": {
    "subqueries": [
      "What effect does applying force in the opposite direction of motion have on an object's velocity?",
      "How does decreasing velocity affect an object's kinetic energy?",
      "What are other potential effects on a moving object when external forces act against it? "
    ]
  },
  "125": {
    "subqueries": [
      "What specific environmental conditions are present in desert areas?",
      "How do these conditions affect plant growth and survival?",
      "Are there any types of plants known for successfully growing in desert environments?  "
    ]
  },
  "7-932": {
    "subqueries": [
      "What are some common applications or technologies that utilize radio waves?",
      "How do these applications benefit from using radio technology?",
      "Can you provide an example of how one specific application uses a radio? "
    ]
  },
  "7-747": {
    "subqueries": [
      "What are some examples of factors or resources considered \"good\" for the survival of organisms?",
      "How does an increase in these beneficial factors or resources impact the survival and growth of specific organisms?",
      "Can you provide real-world scenarios where an increase in such factors has led to improved survival rates of certain organisms?"
    ]
  },
  "9-999": {
    "subqueries": [
      "What are the chemical reactions involved in turning beef from red to brown?",
      "What types of energy sources can facilitate these chemical reactions?",
      "Which specific form or forms of energy are typically used during cooking to cause this color change?"
    ]
  },
  "8-382": {
    "subqueries": [
      "What is the current location or starting point of the person?",
      "Where is the destination they are traveling to?",
      "How can the remaining distance be calculated from their current location to the destination? "
    ]
  },
  "9-103": {
    "subqueries": [
      "What are the primary components of the Earth's crust?",
      "How do tectonic plates contribute to the composition of the Earth's surface?",
      "What role do oceanic and continental features play in defining the Earth's surface?"
    ]
  },
  "8-67": {
    "subqueries": [
      "What is the mechanism by which plants can germinate from contact with a person?",
      "Which types of plants are capable of spreading or germinating through human contact?",
      "What specific parts of a plant (e.g., seeds, spores) are involved in this process? "
    ]
  },
  "9-1044": {
    "subqueries": [
      "What characteristics define a frog's reproductive process?",
      "How do frogs typically care for or watch over their eggs after laying them?",
      "What happens to the eggs during this period of being watched over by the frog? "
    ]
  },
  "9-685": {
    "subqueries": [
      "What functions are associated with the excretory system?",
      "Which rooms in a house typically serve similar functions as those of the excretory system?",
      "How can these rooms symbolically represent the roles and processes of the excretory system?"
    ]
  },
  "7-640": {
    "subqueries": [
      "What are the ecological impacts of a tree burning down?",
      "How can new trees or vegetation be replanted in an area where a tree has burned down?",
      "What steps can be taken to prevent further damage and promote recovery in the ecosystem after a tree burns down?"
    ]
  },
  "9-469": {
    "subqueries": [
      "What are phase changes, and what types of phase changes exist?",
      "How do phase changes affect the physical properties of a substance?",
      "What energy transformations occur during a phase change?"
    ]
  },
  "1374": {
    "subqueries": [
      "What is the first step in a typical food chain?",
      "How do organisms at this step obtain their energy?",
      "In what way do these organisms support or sustain other levels of the food chain?"
    ]
  },
  "1151": {
    "subqueries": [
      "What are the properties of water at 50 degrees Celsius?",
      "How does temperature affect the state or behavior of water?",
      "Is there any specific usage or characteristic unique to water at this particular temperature? "
    ]
  },
  "7-242": {
    "subqueries": [
      "What are the primary behaviors of owls during nighttime?",
      "How do these behaviors differ from daytime activities for owls?",
      "Are there any specific environmental or ecological factors that influence what owls do at night? "
    ]
  }
}